/*
 * This file is part of the coreboot project.
 *
 * Copyright (C) 2017 Samsung Electronics
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; version 2 of the License.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
 */

#ifndef _CPU_TURBO_TRAV_CLOCK_INIT_H_
#define _CPU_TURBO_TRAV_CLOCK_INIT_H_

#include <stdint.h>

/* Macro for PLL */
#define MDIV_SHIFT  (16)
#define PDIV_SHIFT  (8)
#define SDIV_SHIFT  (0)
#define KDIV_SHIFT  (0)
#define CON0_VALUE(m, p, s) \
			(((m) << MDIV_SHIFT) | ((p) << PDIV_SHIFT) | \
			((s) << SDIV_SHIFT) | (1 << 31))

#define PLL_LOCKED  (1 << 29)
#define WAIT_FOR_LOCKED(sfr)    while(!(sfr & PLL_LOCKED))

#define PLL_MUX_SEL(src) (src << 4)
#define PLL_MUX_BUSY    (1 << 7)
#define WAIT_FOR_PLL_MUX_SET_DONE(sfr)  while(sfr & PLL_MUX_BUSY)

/* Macro for MUX */
#define MUX_SEL(src) src

#define MUX_BUSY    (1 << 16)
#define WAIT_FOR_MUX_SET_DONE(sfr)  while(sfr & MUX_BUSY)

#define DIV_VAL(val)    (val - 1)
#define DIV_BUSY    (1 << 16)
#define WAIT_FOR_DIV_SET_DONE(sfr)  while(sfr & DIV_BUSY)

struct cmu_csi {
	uint32_t	PLL_LOCKTIME_PLL_CAM_CSI;
	uint8_t		res0[0xfc];
	uint32_t	PLL_CON0_PLL_CAM_CSI;
	uint32_t	PLL_CON1_PLL_CAM_CSI;
	uint32_t	PLL_CON2_PLL_CAM_CSI;
	uint8_t		res1[0x4];
	uint32_t	PLL_CON4_PLL_CAM_CSI;
	uint8_t		res2[0x6ec];
	uint32_t	CAM_CSI_CMU_CONTROLLER_OPTION;
	uint8_t		res3[0xc];
	uint32_t	CLKOUT_CON_BLK_CAM_CSI_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_CAM_CSI_CMU_CLKOUT1;
	uint8_t		res4[0xfe8];
	uint32_t	CLK_CON_DIV_DIV_CAM_CSI0_ACLK;
	uint32_t	CLK_CON_DIV_DIV_CAM_CSI1_ACLK;
	uint32_t	CLK_CON_DIV_DIV_CAM_CSI2_ACLK;
	uint32_t	CLK_CON_DIV_DIV_CAM_CSI_BUSD;
	uint32_t	CLK_CON_DIV_DIV_CAM_CSI_BUSP;
	uint8_t		res5[0x7ec];
	uint32_t	CLK_CON_GAT_CLK_BLK_CAM_CSI_UID_CAM_CSI_CMU_CAM_CSI_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_AXI2APB_CAM_CSI_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI0;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI1;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI2;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_SOC_NOC;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__NOC;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_0_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_0_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_1_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_1_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_2_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_2_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_3_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI0_3_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_0_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_0_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_1_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_1_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_2_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_2_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_3_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI1_3_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_0_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_0_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_1_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_1_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_2_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_2_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_3_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_CSI2_3_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_NS_BRDG_CAM_CSI_IPCLKPORT_CLK__PSOC_CAM_CSI__CLK_CAM_CSI_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_NS_BRDG_CAM_CSI_IPCLKPORT_CLK__PSOC_CAM_CSI__CLK_CAM_CSI_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_SYSREG_CAM_CSI_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_CSI_UID_TBU_CAM_CSI_IPCLKPORT_ACLK;
	uint8_t		res6[0xf74];
	uint32_t	DMYQCH_CON_CSI0_0_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI0_1_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI0_2_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI0_3_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI1_0_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI1_1_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI1_2_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI1_3_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI2_0_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI2_1_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI2_2_QCH_DUMMY_CSI;
	uint32_t	DMYQCH_CON_CSI2_3_QCH_DUMMY_CSI;
	uint32_t	LPI_CON_CSI0_0_LPI_CSI0;
	uint32_t	LPI_CON_CSI0_1_LPI_CSI0;
	uint32_t	LPI_CON_CSI0_2_LPI_CSI0;
	uint32_t	LPI_CON_CSI0_3_LPI_CSI0;
	uint32_t	LPI_CON_CSI1_0_LPI_CSI1;
	uint32_t	LPI_CON_CSI1_1_LPI_CSI1;
	uint32_t	LPI_CON_CSI1_2_LPI_CSI1;
	uint32_t	LPI_CON_CSI1_3_LPI_CSI1;
	uint32_t	LPI_CON_CSI2_0_LPI_CSI2;
	uint32_t	LPI_CON_CSI2_1_LPI_CSI2;
	uint32_t	LPI_CON_CSI2_2_LPI_CSI2;
	uint32_t	LPI_CON_CSI2_3_LPI_CSI2;
	uint32_t	QCH_CON_BUS_D_CAM_CSI_QCH_BUS_D_CAM_CSI;
	uint32_t	QCH_CON_CAM_CSI_CMU_CAM_CSI_QCH;
	uint32_t	QCH_CON_NS_BRDG_CAM_CSI_PSOC_CAM_CSI_QCH;
	uint32_t	QCH_CON_SYSREG_CAM_CSI_SYSREG_CAM_CSI_QCH;
	uint32_t	QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_CG_QCH;
	uint32_t	QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_MST_BR_QCH;
	uint32_t	QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_PD_QCH;
	uint32_t	QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_SLV_BR_QCH;
	uint8_t		res7[0xb80];
	uint32_t	QUEUE_CTRL_REG_BLK_CAM_CSI_CMU_CAM_CSI;
	uint8_t		res8[0x3fc];
	uint32_t	DBG_NFO_PLL_CAM_CSI;
	uint8_t		res9[0x80c];
	uint32_t	DBG_NFO_BLK_CAM_CSI_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_CAM_CSI_CMU_CLKOUT1;
	uint8_t		res10[0xfe8];
	uint32_t	DBG_NFO_DIV_CAM_CSI0_ACLK;
	uint32_t	DBG_NFO_DIV_CAM_CSI1_ACLK;
	uint32_t	DBG_NFO_DIV_CAM_CSI2_ACLK;
	uint32_t	DBG_NFO_DIV_CAM_CSI_BUSD;
	uint32_t	DBG_NFO_DIV_CAM_CSI_BUSP;
	uint8_t		res11[0x7ec];
	uint32_t	DBG_NFO_CLK_BLK_CAM_CSI_UID_CAM_CSI_CMU_CAM_CSI_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_AXI2APB_CAM_CSI_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI0;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI1;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_CSI2;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__CLK_SOC_NOC;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_BUS_D_CAM_CSI_IPCLKPORT_CLK__SYSTEM__NOC;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_0_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_0_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_1_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_1_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_2_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_2_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_3_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI0_3_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_0_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_0_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_1_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_1_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_2_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_2_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_3_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI1_3_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_0_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_0_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_1_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_1_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_2_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_2_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_3_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_CSI2_3_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_NS_BRDG_CAM_CSI_IPCLKPORT_CLK__PSOC_CAM_CSI__CLK_CAM_CSI_D;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_NS_BRDG_CAM_CSI_IPCLKPORT_CLK__PSOC_CAM_CSI__CLK_CAM_CSI_P;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_SYSREG_CAM_CSI_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_CSI_UID_TBU_CAM_CSI_IPCLKPORT_ACLK;
	uint8_t		res12[0xf74];
	uint32_t	DBG_NFO_DMYQCH_CON_CSI0_0_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI0_1_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI0_2_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI0_3_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI1_0_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI1_1_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI1_2_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI1_3_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI2_0_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI2_1_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI2_2_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_DMYQCH_CON_CSI2_3_QCH_DUMMY_CSI;
	uint32_t	DBG_NFO_LPI_CON_CSI0_0_LPI_CSI0;
	uint32_t	DBG_NFO_LPI_CON_CSI0_1_LPI_CSI0;
	uint32_t	DBG_NFO_LPI_CON_CSI0_2_LPI_CSI0;
	uint32_t	DBG_NFO_LPI_CON_CSI0_3_LPI_CSI0;
	uint32_t	DBG_NFO_LPI_CON_CSI1_0_LPI_CSI1;
	uint32_t	DBG_NFO_LPI_CON_CSI1_1_LPI_CSI1;
	uint32_t	DBG_NFO_LPI_CON_CSI1_2_LPI_CSI1;
	uint32_t	DBG_NFO_LPI_CON_CSI1_3_LPI_CSI1;
	uint32_t	DBG_NFO_LPI_CON_CSI2_0_LPI_CSI2;
	uint32_t	DBG_NFO_LPI_CON_CSI2_1_LPI_CSI2;
	uint32_t	DBG_NFO_LPI_CON_CSI2_2_LPI_CSI2;
	uint32_t	DBG_NFO_LPI_CON_CSI2_3_LPI_CSI2;
	uint32_t	DBG_NFO_QCH_CON_BUS_D_CAM_CSI_QCH_BUS_D_CAM_CSI;
	uint32_t	DBG_NFO_QCH_CON_CAM_CSI_CMU_CAM_CSI_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_CAM_CSI_PSOC_CAM_CSI_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_CAM_CSI_SYSREG_CAM_CSI_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_CG_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_MST_BR_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_PD_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_CSI_TBU_CAM_CSI_SLV_BR_QCH;
};

struct cmu_dprx0 {
	uint32_t	PLL_LOCKTIME_PLL_CAM_DPRX;
	uint8_t		res0[0xfc];
	uint32_t	PLL_CON0_BLK_DPRX0_DSC_CLK_MUX;
	uint32_t	PLL_CON1_BLK_DPRX0_DSC_CLK_MUX;
	uint32_t	PLL_CON2_BLK_DPRX0_DSC_CLK_MUX;
	uint8_t		res1[0x14];
	uint32_t	PLL_CON0_DPRX_TOPCMUSWITCHCLK_MUX;
	uint32_t	PLL_CON1_DPRX_TOPCMUSWITCHCLK_MUX;
	uint32_t	PLL_CON2_DPRX_TOPCMUSWITCHCLK_MUX;
	uint8_t		res2[0x14];
	uint32_t	PLL_CON0_PLL_CAM_DPRX;
	uint32_t	PLL_CON1_PLL_CAM_DPRX;
	uint32_t	PLL_CON2_PLL_CAM_DPRX;
	uint8_t		res3[0x4];
	uint32_t	PLL_CON4_PLL_CAM_DPRX;
	uint8_t		res4[0x6ac];
	uint32_t	CAM_DPRX0_CMU_CONTROLLER_OPTION;
	uint8_t		res5[0xc];
	uint32_t	CLKOUT_CON_BLK_CAM_DPRX0_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_CAM_DPRX0_CMU_CLKOUT1;
	uint8_t		res6[0x7e8];
	uint32_t	CLK_CON_MUX_DPRX_SWITCH_MUX;
	uint8_t		res7[0x7fc];
	uint32_t	CLK_CON_DIV_DIV_CLK_BLK_DPRX0_BUSD;
	uint32_t	CLK_CON_DIV_DIV_CLK_BLK_DPRX0_BUSP;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX2_DSC_CLK;
	uint8_t		res8[0x8];
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX2_RXCLK;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX3_DSC_CLK;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX3_RXCLK;
	uint32_t	CLK_CON_DIV_DIV_HDCP_CLK;
	uint8_t		res9[0x7dc];
	uint32_t	CLK_CON_GAT_CLK_BLK_CAM_DPRX0_UID_CAM_DPRX0_CMU_DPRX0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_CAM_DPRX0_UID_HDCP_SRAM_IPCLKPORT_I_REF_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_ADS_AXI_P_CAM_DPRX_IPCLKPORT_ACLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX2_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX2_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX3_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX3_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_AXI2APB_CAM_DPRX0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_BUS_D_CAM_DPRX_0_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_BUS_P_CAM_DPRX_0_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_BUS_P_CAM_DPRX_0_IPCLKPORT_MAINCLK_R;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_I_DSC_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_RXCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_I_DSC_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_RXCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_HDCP_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_HDCP_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_HDCP_SRAM_IPCLKPORT_I_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_NS_BRDG_CAM_DPRX_0_IPCLKPORT_CLK__PSOC_CAM_DPRX__CLK_CAM_DPRX_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_NS_BRDG_CAM_DPRX_0_IPCLKPORT_CLK__PSOC_CAM_DPRX__CLK_CAM_DPRX_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_SYSREG_CAM_DPRX0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX0_UID_TBU_CAM_DPRX_0_IPCLKPORT_ACLK;
	uint8_t		res10[0xf98];
	uint32_t	DMYQCH_CON_APB_ASYNC_DPRX2_QCH_DUMMY_ASYNC_APB_DPRX2;
	uint32_t	DMYQCH_CON_APB_ASYNC_DPRX3_QCH_DUMMY_ASYNC_APB_DPRX3;
	uint32_t	DMYQCH_CON_HDCP_QCH_DUMMY_HDCP;
	uint32_t	LPI_CON_BUS_P_CAM_DPRX_0_LPI_BUS_P;
	uint32_t	QCH_CON_ADS_AXI_P_CAM_DPRX_QCH_CLK;
	uint32_t	QCH_CON_ADS_AXI_P_CAM_DPRX_QCH_PWR;
	uint32_t	QCH_CON_BUS_D_CAM_DPRX_0_BUS_D_CAM_DPRX0_QCH;
	uint32_t	QCH_CON_CAM_DPRX0_CMU_DPRX0_QCH;
	uint32_t	QCH_CON_DPRX2_DPRX2_QCH;
	uint32_t	QCH_CON_DPRX3_DPRX3_QCH;
	uint32_t	QCH_CON_NS_BRDG_CAM_DPRX_0_PSOC_CAM_DPRX_QCH;
	uint32_t	QCH_CON_SYSREG_CAM_DPRX0_SYSREG_CAM_DPRX_QCH;
	uint8_t		res11[0x4];
	uint32_t	QCH_CON_TBU_CAM_DPRX_0_QCH_CG;
	uint32_t	QCH_CON_TBU_CAM_DPRX_0_QCH_PD;
	uint32_t	QCH_CON_TBU_CAM_DPRX_0_QCH_PD_MST_BR;
	uint32_t	QCH_CON_TBU_CAM_DPRX_0_QCH_PD_SLV_BR;
	uint8_t		res12[0xbbc];
	uint32_t	QUEUE_CTRL_REG_BLK_CAM_DPRX0_CMU_DPRX0;
	uint8_t		res13[0x3fc];
	uint32_t	DBG_NFO_BLK_DPRX0_DSC_CLK_MUX;
	uint8_t		res14[0x1c];
	uint32_t	DBG_NFO_DPRX_TOPCMUSWITCHCLK_MUX;
	uint8_t		res15[0x1c];
	uint32_t	DBG_NFO_PLL_CAM_DPRX;
	uint8_t		res16[0x7cc];
	uint32_t	DBG_NFO_BLK_CAM_DPRX0_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_CAM_DPRX0_CMU_CLKOUT1;
	uint8_t		res17[0x7e8];
	uint32_t	DBG_NFO_DPRX_SWITCH_MUX;
	uint8_t		res18[0x7fc];
	uint32_t	DBG_NFO_DIV_CLK_BLK_DPRX0_BUSD;
	uint32_t	DBG_NFO_DIV_CLK_BLK_DPRX0_BUSP;
	uint32_t	DBG_NFO_DIV_CLK_DPRX2_DSC_CLK;
	uint8_t		res19[0x8];
	uint32_t	DBG_NFO_DIV_CLK_DPRX2_RXCLK;
	uint32_t	DBG_NFO_DIV_CLK_DPRX3_DSC_CLK;
	uint32_t	DBG_NFO_DIV_CLK_DPRX3_RXCLK;
	uint32_t	DBG_NFO_DIV_HDCP_CLK;
	uint8_t		res20[0x7dc];
	uint32_t	DBG_NFO_CLK_BLK_CAM_DPRX0_UID_CAM_DPRX0_CMU_DPRX0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_CLK_BLK_CAM_DPRX0_UID_HDCP_SRAM_IPCLKPORT_I_REF_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_ADS_AXI_P_CAM_DPRX_IPCLKPORT_ACLKS;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX2_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX2_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX3_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_APB_ASYNC_DPRX3_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_AXI2APB_CAM_DPRX0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_BUS_D_CAM_DPRX_0_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_BUS_P_CAM_DPRX_0_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_BUS_P_CAM_DPRX_0_IPCLKPORT_MAINCLK_R;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_I_DSC_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX2_IPCLKPORT_RXCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_I_DSC_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_DPRX3_IPCLKPORT_RXCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_HDCP_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_HDCP_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_HDCP_SRAM_IPCLKPORT_I_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_NS_BRDG_CAM_DPRX_0_IPCLKPORT_CLK__PSOC_CAM_DPRX__CLK_CAM_DPRX_D;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_NS_BRDG_CAM_DPRX_0_IPCLKPORT_CLK__PSOC_CAM_DPRX__CLK_CAM_DPRX_P;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_SYSREG_CAM_DPRX0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX0_UID_TBU_CAM_DPRX_0_IPCLKPORT_ACLK;
	uint8_t		res21[0xf98];
	uint32_t	DBG_NFO_DMYQCH_CON_APB_ASYNC_DPRX2_QCH_DUMMY_ASYNC_APB_DPRX2;
	uint32_t	DBG_NFO_DMYQCH_CON_APB_ASYNC_DPRX3_QCH_DUMMY_ASYNC_APB_DPRX3;
	uint32_t	DBG_NFO_DMYQCH_CON_HDCP_QCH_DUMMY_HDCP;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_CAM_DPRX_0_LPI_BUS_P;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI_P_CAM_DPRX_QCH_CLK;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI_P_CAM_DPRX_QCH_PWR;
	uint32_t	DBG_NFO_QCH_CON_BUS_D_CAM_DPRX_0_BUS_D_CAM_DPRX0_QCH;
	uint32_t	DBG_NFO_QCH_CON_CAM_DPRX0_CMU_DPRX0_QCH;
	uint32_t	DBG_NFO_QCH_CON_DPRX2_DPRX2_QCH;
	uint32_t	DBG_NFO_QCH_CON_DPRX3_DPRX3_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_CAM_DPRX_0_PSOC_CAM_DPRX_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_CAM_DPRX0_SYSREG_CAM_DPRX_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_0_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_0_QCH_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_0_QCH_PD;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_0_QCH_PD_MST_BR;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_0_QCH_PD_SLV_BR;
};

struct cmu_dprx1 {
	uint8_t		res0[0x100];
	uint32_t	PLL_CON0_BLK_DPRX1_DSC_CLK_MUX;
	uint32_t	PLL_CON1_BLK_DPRX1_DSC_CLK_MUX;
	uint32_t	PLL_CON2_BLK_DPRX1_DSC_CLK_MUX;
	uint8_t		res1[0x14];
	uint32_t	PLL_CON0_DPRX1_BUSD_MUX;
	uint32_t	PLL_CON1_DPRX1_BUSD_MUX;
	uint32_t	PLL_CON2_DPRX1_BUSD_MUX;
	uint8_t		res2[0x14];
	uint32_t	PLL_CON0_DPRX1_RXCLK_MUX;
	uint32_t	PLL_CON1_DPRX1_RXCLK_MUX;
	uint32_t	PLL_CON2_DPRX1_RXCLK_MUX;
	uint8_t		res3[0x6b4];
	uint32_t	CAM_DPRX1_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_CAM_DPRX1_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_CAM_DPRX1_CMU_CLKOUT1;
	uint8_t		res5[0xfe8];
	uint32_t	CLK_CON_DIV_DIV_CLK_BLK_DPRX1_BUSD;
	uint32_t	CLK_CON_DIV_DIV_CLK_BLK_DPRX1_BUSP;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX0_DSC_CLK;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX0_RXCLK;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX1_DSC_CLK;
	uint32_t	CLK_CON_DIV_DIV_CLK_DPRX1_RXCLK;
	uint8_t		res6[0x7e8];
	uint32_t	CLK_CON_GAT_CLK_BLK_CAM_DPRX1_UID_CAM_DPRX1_CMU_DPRX1_IPCLKPORT_PCLK;
	uint8_t		res7[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_ADM_AXI_P_CAM_DPRX_IPCLKPORT_ACLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX0_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX0_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX1_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX1_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_AXI2APB_CAM_DPRX1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_BUS_D_CAM_DPRX_1_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_BUS_P_CAM_DPRX_1_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_BUS_P_CAM_DPRX_1_IPCLKPORT_MAINCLK_R;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_I_DSC_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_RXCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_I_DSC_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_RXCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_NS_BRDG_CAM_DPRX_1_IPCLKPORT_CLK__PSOC_CAM_DPRX1__CLK_CAM_DPRX_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_SYSREG_CAM_DPRX1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CAM_DPRX1_UID_TBU_CAM_DPRX_1_IPCLKPORT_ACLK;
	uint8_t		res8[0xfa8];
	uint32_t	DMYQCH_CON_APB_ASYNC_DPRX0_QCH_DUMMY_ASYNC_APB_DPRX0;
	uint32_t	DMYQCH_CON_APB_ASYNC_DPRX1_QCH_DUMMY_ASYNC_APB_DPRX1;
	uint32_t	LPI_CON_AXI2APB_CAM_DPRX1_QST;
	uint32_t	LPI_CON_BUS_P_CAM_DPRX_1_LPI_BUS_P;
	uint32_t	LPI_CON_DFT_DPRX1_QST;
	uint32_t	QCH_CON_ADM_AXI_P_CAM_DPRX_QCH_CLK;
	uint32_t	QCH_CON_BUS_D_CAM_DPRX_1_BUS_D_CAM_DPRX1_QCH;
	uint32_t	QCH_CON_CAM_DPRX1_CMU_DPRX1_QCH;
	uint32_t	QCH_CON_DPRX0_DPRX0_QCH;
	uint32_t	QCH_CON_DPRX1_DPRX1_QCH;
	uint32_t	QCH_CON_NS_BRDG_CAM_DPRX_1_PSOC_CAM_DPRX_QCH;
	uint32_t	QCH_CON_SYSREG_CAM_DPRX1_SYSREG_CAM_DPRX1_QCH;
	uint32_t	QCH_CON_TBU_CAM_DPRX_1_QCH_CG;
	uint32_t	QCH_CON_TBU_CAM_DPRX_1_QCH_PD;
	uint32_t	QCH_CON_TBU_CAM_DPRX_1_QCH_PD_MST_BR;
	uint32_t	QCH_CON_TBU_CAM_DPRX_1_QCH_PD_SLV_BR;
	uint8_t		res9[0xbc0];
	uint32_t	QUEUE_CTRL_REG_BLK_CAM_DPRX1_CMU_DPRX1;
	uint8_t		res10[0x3fc];
	uint32_t	DBG_NFO_BLK_DPRX1_DSC_CLK_MUX;
	uint8_t		res11[0x1c];
	uint32_t	DBG_NFO_DPRX1_BUSD_MUX;
	uint8_t		res12[0x1c];
	uint32_t	DBG_NFO_DPRX1_RXCLK_MUX;
	uint8_t		res13[0x7cc];
	uint32_t	DBG_NFO_BLK_CAM_DPRX1_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_CAM_DPRX1_CMU_CLKOUT1;
	uint8_t		res14[0xfe8];
	uint32_t	DBG_NFO_DIV_CLK_BLK_DPRX1_BUSD;
	uint32_t	DBG_NFO_DIV_CLK_BLK_DPRX1_BUSP;
	uint32_t	DBG_NFO_DIV_CLK_DPRX0_DSC_CLK;
	uint32_t	DBG_NFO_DIV_CLK_DPRX0_RXCLK;
	uint32_t	DBG_NFO_DIV_CLK_DPRX1_DSC_CLK;
	uint32_t	DBG_NFO_DIV_CLK_DPRX1_RXCLK;
	uint8_t		res15[0x7e8];
	uint32_t	DBG_NFO_CLK_BLK_CAM_DPRX1_UID_CAM_DPRX1_CMU_DPRX1_IPCLKPORT_PCLK;
	uint8_t		res16[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_ADM_AXI_P_CAM_DPRX_IPCLKPORT_ACLKM;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX0_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX0_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX1_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_APB_ASYNC_DPRX1_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_AXI2APB_CAM_DPRX1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_BUS_D_CAM_DPRX_1_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_BUS_P_CAM_DPRX_1_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_BUS_P_CAM_DPRX_1_IPCLKPORT_MAINCLK_R;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_I_DSC_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX0_IPCLKPORT_RXCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_I_DSC_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_DPRX1_IPCLKPORT_RXCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_NS_BRDG_CAM_DPRX_1_IPCLKPORT_CLK__PSOC_CAM_DPRX1__CLK_CAM_DPRX_D;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_SYSREG_CAM_DPRX1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CAM_DPRX1_UID_TBU_CAM_DPRX_1_IPCLKPORT_ACLK;
	uint8_t		res17[0xfa8];
	uint32_t	DBG_NFO_DMYQCH_CON_APB_ASYNC_DPRX0_QCH_DUMMY_ASYNC_APB_DPRX0;
	uint32_t	DBG_NFO_DMYQCH_CON_APB_ASYNC_DPRX1_QCH_DUMMY_ASYNC_APB_DPRX1;
	uint32_t	DBG_NFO_LPI_CON_AXI2APB_CAM_DPRX1_QST;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_CAM_DPRX_1_LPI_BUS_P;
	uint32_t	DBG_NFO_LPI_CON_DFT_DPRX1_QST;
	uint32_t	DBG_NFO_QCH_CON_ADM_AXI_P_CAM_DPRX_QCH_CLK;
	uint32_t	DBG_NFO_QCH_CON_BUS_D_CAM_DPRX_1_BUS_D_CAM_DPRX1_QCH;
	uint32_t	DBG_NFO_QCH_CON_CAM_DPRX1_CMU_DPRX1_QCH;
	uint32_t	DBG_NFO_QCH_CON_DPRX0_DPRX0_QCH;
	uint32_t	DBG_NFO_QCH_CON_DPRX1_DPRX1_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_CAM_DPRX_1_PSOC_CAM_DPRX_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_CAM_DPRX1_SYSREG_CAM_DPRX1_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_1_QCH_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_1_QCH_PD;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_1_QCH_PD_MST_BR;
	uint32_t	DBG_NFO_QCH_CON_TBU_CAM_DPRX_1_QCH_PD_SLV_BR;
};

struct cmu_cmu {
	uint32_t	PLL_LOCKTIME_PLL_SHARED0;
	uint32_t	PLL_LOCKTIME_PLL_SHARED1;
	uint32_t	PLL_LOCKTIME_PLL_SHARED2;
	uint32_t	PLL_LOCKTIME_PLL_SHARED3;
	uint8_t		res0[0xf0];
	uint32_t	PLL_CON0_PLL_SHARED0;
	uint32_t	PLL_CON1_PLL_SHARED0;
	uint32_t	PLL_CON2_PLL_SHARED0;
	uint8_t		res1[0x4];
	uint32_t	PLL_CON4_PLL_SHARED0;
	uint8_t		res2[0xc];
	uint32_t	PLL_CON0_PLL_SHARED1;
	uint32_t	PLL_CON1_PLL_SHARED1;
	uint32_t	PLL_CON2_PLL_SHARED1;
	uint8_t		res3[0x4];
	uint32_t	PLL_CON4_PLL_SHARED1;
	uint8_t		res4[0xc];
	uint32_t	PLL_CON0_PLL_SHARED2;
	uint32_t	PLL_CON1_PLL_SHARED2;
	uint32_t	PLL_CON2_PLL_SHARED2;
	uint8_t		res5[0x4];
	uint32_t	PLL_CON4_PLL_SHARED2;
	uint8_t		res6[0xc];
	uint32_t	PLL_CON0_PLL_SHARED3;
	uint32_t	PLL_CON1_PLL_SHARED3;
	uint32_t	PLL_CON2_PLL_SHARED3;
	uint8_t		res7[0x4];
	uint32_t	PLL_CON4_PLL_SHARED3;
	uint8_t		res8[0x68c];
	uint32_t	CMU_CMU_CONTROLLER_OPTION;
	uint8_t		res9[0xc];
	uint32_t	CLKOUT_CON_BLK_CMU_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_CMU_CMU_CLKOUT1;
	uint8_t		res10[0x7e8];
	uint32_t	CLK_CON_MUX_CLKCMU_CIS0_CLKMUX;
	uint32_t	CLK_CON_MUX_CLKCMU_CIS1_CLKMUX;
	uint32_t	CLK_CON_MUX_CLKCMU_CIS2_CLKMUX;
	uint32_t	CLK_CON_MUX_CLKCMU_CPUCL_SWITCHMUX;
	uint32_t	CLK_CON_MUX_CLKCMU_DPRX_SWITCHCLK_MUX;
	uint32_t	CLK_CON_MUX_CLKCMU_FSYS1_ACLK_MUX;
	uint32_t	CLK_CON_MUX_CLKCMU_GPU_SWITCHCLK_MUX;
	uint32_t	CLK_CON_MUX_CLKCMU_TRIP_SWITCHCLK_MUX;
	uint32_t	CLK_CON_MUX_PLL_SHARED0_MUX;
	uint32_t	CLK_CON_MUX_PLL_SHARED1_MUX;
	uint8_t		res11[0x7d8];
	uint32_t	CLK_CON_DIV_CLKCMU_CIS0_CLK;
	uint32_t	CLK_CON_DIV_CLKCMU_CIS1_CLK;
	uint32_t	CLK_CON_DIV_CLKCMU_CIS2_CLK;
	uint32_t	CLK_CON_DIV_CLKCMU_CMU_ACLK;
	uint32_t	CLK_CON_DIV_CLKCMU_CPUCL_SWITCH;
	uint32_t	CLK_CON_DIV_CLKCMU_DPRX_DSC_CLK;
	uint32_t	CLK_CON_DIV_CLKCMU_DPRX_SWITCHCLK;
	uint32_t	CLK_CON_DIV_CLKCMU_FSYS0_SHARED0DIV4;
	uint32_t	CLK_CON_DIV_CLKCMU_FSYS0_SHARED1DIV3;
	uint32_t	CLK_CON_DIV_CLKCMU_FSYS0_SHARED1DIV4;
	uint32_t	CLK_CON_DIV_CLKCMU_FSYS1_SHARED0DIV4;
	uint32_t	CLK_CON_DIV_CLKCMU_FSYS1_SHARED0DIV8;
	uint32_t	CLK_CON_DIV_CLKCMU_GPU_MAIN_SWITCH;
	uint32_t	CLK_CON_DIV_CLKCMU_IMEM_ACLK;
	uint32_t	CLK_CON_DIV_CLKCMU_IMEM_DMACLK;
	uint32_t	CLK_CON_DIV_CLKCMU_IMEM_TCUCLK;
	uint32_t	CLK_CON_DIV_CLKCMU_ISP_TCUCLK;
	uint32_t	CLK_CON_DIV_CLKCMU_PERIC_SHARED0DIV20;
	uint32_t	CLK_CON_DIV_CLKCMU_PERIC_SHARED0DIV3_TBUCLK;
	uint32_t	CLK_CON_DIV_CLKCMU_PERIC_SHARED1DIV36;
	uint32_t	CLK_CON_DIV_CLKCMU_PERIC_SHARED1DIV4_DMACLK;
	uint32_t	CLK_CON_DIV_CLKCMU_TRIP_SWITCHCLK;
	uint32_t	CLK_CON_DIV_PLL_SHARED0_DIV2;
	uint32_t	CLK_CON_DIV_PLL_SHARED0_DIV3;
	uint32_t	CLK_CON_DIV_PLL_SHARED0_DIV4;
	uint32_t	CLK_CON_DIV_PLL_SHARED0_DIV6;
	uint32_t	CLK_CON_DIV_PLL_SHARED1_DIV3;
	uint32_t	CLK_CON_DIV_PLL_SHARED1_DIV36;
	uint32_t	CLK_CON_DIV_PLL_SHARED1_DIV4;
	uint32_t	CLK_CON_DIV_PLL_SHARED1_DIV9;
	uint8_t		res12[0x788];
	uint32_t	CLK_CON_GAT_CLKCMU_CIS0_CLKGATE;
	uint32_t	CLK_CON_GAT_CLKCMU_CIS1_CLKGATE;
	uint32_t	CLK_CON_GAT_CLKCMU_CIS2_CLKGATE;
	uint32_t	CLK_CON_GAT_CLKCMU_CPUCL_SWITCH_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_DPRX_DSC_CLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_DPRX_SWITCHCLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_FSYS0_SHARED0DIV4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_FSYS0_SHARED1DIV4_CLK;
	uint32_t	CLK_CON_GAT_CLKCMU_FSYS0_SHARED1DIV4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_FSYS1_SHARED0DIV4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_FSYS1_SHARED1DIV4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_GPU_SWITCHCLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_IMEM_ACLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_IMEM_DMACLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_IMEM_TCUCLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_ISP_TCUCLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_PERIC_SHARED0DIVE3_TBUCLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_PERIC_SHARED0DIVE4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_PERIC_SHARED1DIV4_DMACLK_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_PERIC_SHARED1DIVE4_GATE;
	uint32_t	CLK_CON_GAT_CLKCMU_TRIP_SWITCHCLK_GATE;
	uint32_t	CLK_CON_GAT_CLK_BLK_CMU_UID_CMU_CMU_CMU_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CMU_UID_AXI2APB_CMU_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CMU_UID_NS_BRDG_CMU_IPCLKPORT_CLK__PSOC_CMU__CLK_CMU;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CMU_UID_SYSREG_CMU_IPCLKPORT_PCLK;
	uint32_t	QCH_CON_AXI2APB_CMU_QCH;
	uint8_t		res13[0xf98];
	uint32_t	DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS0;
	uint32_t	DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS1;
	uint32_t	DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS2;
	uint32_t	QCH_CON_CMU_CMU_CMU_QCH;
	uint32_t	QCH_CON_NS_BRDG_CMU_PSOC_CMU_QCH;
	uint32_t	QCH_CON_SYSREG_CMU_QCH;
	uint8_t		res14[0xbe8];
	uint32_t	QUEUE_CTRL_REG_BLK_CMU_CMU_CMU;
	uint8_t		res15[0x3fc];
	uint32_t	DBG_NFO_PLL_SHARED0;
	uint8_t		res16[0x1c];
	uint32_t	DBG_NFO_PLL_SHARED1;
	uint8_t		res17[0x1c];
	uint32_t	DBG_NFO_PLL_SHARED2;
	uint8_t		res18[0x1c];
	uint32_t	DBG_NFO_PLL_SHARED3;
	uint8_t		res19[0x7ac];
	uint32_t	DBG_NFO_BLK_CMU_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_CMU_CMU_CLKOUT1;
	uint8_t		res20[0x7e8];
	uint32_t	DBG_NFO_CLKCMU_CIS0_CLKMUX;
	uint32_t	DBG_NFO_CLKCMU_CIS1_CLKMUX;
	uint32_t	DBG_NFO_CLKCMU_CIS2_CLKMUX;
	uint32_t	DBG_NFO_CLKCMU_CPUCL_SWITCHMUX;
	uint32_t	DBG_NFO_CLKCMU_DPRX_SWITCHCLK_MUX;
	uint32_t	DBG_NFO_CLKCMU_FSYS1_ACLK_MUX;
	uint32_t	DBG_NFO_CLKCMU_GPU_SWITCHCLK_MUX;
	uint32_t	DBG_NFO_CLKCMU_TRIP_SWITCHCLK_MUX;
	uint32_t	DBG_NFO_PLL_SHARED0_MUX;
	uint32_t	DBG_NFO_PLL_SHARED1_MUX;
	uint8_t		res21[0x7d8];
	uint32_t	DBG_NFO_CLKCMU_CIS0_CLK;
	uint32_t	DBG_NFO_CLKCMU_CIS1_CLK;
	uint32_t	DBG_NFO_CLKCMU_CIS2_CLK;
	uint32_t	DBG_NFO_CLKCMU_CMU_ACLK;
	uint32_t	DBG_NFO_CLKCMU_CPUCL_SWITCH;
	uint32_t	DBG_NFO_CLKCMU_DPRX_DSC_CLK;
	uint32_t	DBG_NFO_CLKCMU_DPRX_SWITCHCLK;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED0DIV4;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED1DIV3;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED1DIV4;
	uint32_t	DBG_NFO_CLKCMU_FSYS1_SHARED0DIV4;
	uint32_t	DBG_NFO_CLKCMU_FSYS1_SHARED0DIV8;
	uint32_t	DBG_NFO_CLKCMU_GPU_MAIN_SWITCH;
	uint32_t	DBG_NFO_CLKCMU_IMEM_ACLK;
	uint32_t	DBG_NFO_CLKCMU_IMEM_DMACLK;
	uint32_t	DBG_NFO_CLKCMU_IMEM_TCUCLK;
	uint32_t	DBG_NFO_CLKCMU_ISP_TCUCLK;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED0DIV20;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED0DIV3_TBUCLK;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED1DIV36;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED1DIV4_DMACLK;
	uint32_t	DBG_NFO_CLKCMU_TRIP_SWITCHCLK;
	uint32_t	DBG_NFO_PLL_SHARED0_DIV2;
	uint32_t	DBG_NFO_PLL_SHARED0_DIV3;
	uint32_t	DBG_NFO_PLL_SHARED0_DIV4;
	uint32_t	DBG_NFO_PLL_SHARED0_DIV6;
	uint32_t	DBG_NFO_PLL_SHARED1_DIV3;
	uint32_t	DBG_NFO_PLL_SHARED1_DIV36;
	uint32_t	DBG_NFO_PLL_SHARED1_DIV4;
	uint32_t	DBG_NFO_PLL_SHARED1_DIV9;
	uint8_t		res22[0x788];
	uint32_t	DBG_NFO_CLKCMU_CIS0_CLKGATE;
	uint32_t	DBG_NFO_CLKCMU_CIS1_CLKGATE;
	uint32_t	DBG_NFO_CLKCMU_CIS2_CLKGATE;
	uint32_t	DBG_NFO_CLKCMU_CPUCL_SWITCH_GATE;
	uint32_t	DBG_NFO_CLKCMU_DPRX_DSC_CLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_DPRX_SWITCHCLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED0DIV4_GATE;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED1DIV4_CLK;
	uint32_t	DBG_NFO_CLKCMU_FSYS0_SHARED1DIV4_GATE;
	uint32_t	DBG_NFO_CLKCMU_FSYS1_SHARED0DIV4_GATE;
	uint32_t	DBG_NFO_CLKCMU_FSYS1_SHARED1DIV4_GATE;
	uint32_t	DBG_NFO_CLKCMU_GPU_SWITCHCLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_IMEM_ACLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_IMEM_DMACLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_IMEM_TCUCLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_ISP_TCUCLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED0DIVE3_TBUCLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED0DIVE4_GATE;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED1DIV4_DMACLK_GATE;
	uint32_t	DBG_NFO_CLKCMU_PERIC_SHARED1DIVE4_GATE;
	uint32_t	DBG_NFO_CLKCMU_TRIP_SWITCHCLK_GATE;
	uint32_t	DBG_NFO_CLK_BLK_CMU_UID_CMU_CMU_CMU_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CMU_UID_AXI2APB_CMU_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_CMU_UID_NS_BRDG_CMU_IPCLKPORT_CLK__PSOC_CMU__CLK_CMU;
	uint32_t	DBG_NFO_GOUT_BLK_CMU_UID_SYSREG_CMU_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_QCH_CON_AXI2APB_CMU_QCH;
	uint8_t		res23[0xf98];
	uint32_t	DBG_NFO_DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS0;
	uint32_t	DBG_NFO_DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS1;
	uint32_t	DBG_NFO_DMYQCH_CON_DFTMUX_TOP_QCH_DUMMY_CIS2;
	uint32_t	DBG_NFO_QCH_CON_CMU_CMU_CMU_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_CMU_PSOC_CMU_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_CMU_QCH;
};

struct cmu_core_gt {
	uint32_t	PLL_LOCKTIME_PLL_CORE_GT;
	uint8_t		res0[0xfc];
	uint32_t	PLL_CON0_PLL_CORE_GT;
	uint32_t	PLL_CON1_PLL_CORE_GT;
	uint32_t	PLL_CON2_PLL_CORE_GT;
	uint8_t		res1[0x4];
	uint32_t	PLL_CON4_PLL_CORE_GT;
	uint8_t		res2[0x6ec];
	uint32_t	CORE_GT_CMU_CONTROLLER_OPTION;
	uint8_t		res3[0xc];
	uint32_t	CLKOUT_CON_BLK_CORE_GT_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_CORE_GT_CMU_CLKOUT1;
	uint8_t		res4[0x7e8];
	uint32_t	CLK_CON_MUX_CLK_CORE_NOC;
	uint32_t	CLK_CON_MUX_CLK_CORE_PCLK;
	uint32_t	CLK_CON_MUX_CLK_CORE_TRIP_MUX;
	uint8_t		res5[0x7f4];
	uint32_t	CLK_CON_DIV_CLK_CORE_TCU;
	uint32_t	CLK_CON_DIV_DIV_CLK_CORE_ATB;
	uint32_t	CLK_CON_DIV_DIV_MIF_SWITCHCLK;
	uint32_t	CLK_CON_DIV_PLL_CORE_DIV4;
	uint8_t		res6[0x7f0];
	uint32_t	CLK_CON_GAT_CLK_BLK_CORE_GT_UID_CORE_GT_CMU_CORE_GT_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GATE_MIF_SWITCHCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_AXI2APB_CORE_IPCLKPORT_ACLK;
	uint8_t		res7[0x8];
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_LHS_ATB_CCC_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_NS_CORE_GROUP_GT_IPCLKPORT_CLK__PNOC_GROUP_3__REGBUS;
	uint8_t		res8[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_NS_CORE_TRIP_MMU_IPCLKPORT_CLK__P_CORE_TRIP_MMU__CLK_TRIPBU;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_NS_CORE_TRIP_MMU_IPCLKPORT_CLK__P_CORE_TRIP_MMU__CLK_TRIPBU_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_NS_SYSTEM_IPCLKPORT_CLK__SYSTEM__NOC;
	uint8_t		res9[0x10];
	uint32_t	CLK_CON_GAT_GOUT_BLK_CORE_GT_UID_SYSREG_CORE_IPCLKPORT_PCLK;
	uint8_t		res10[0xfc0];
	uint32_t	PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC0_PCH;
	uint32_t	PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC1_PCH;
	uint32_t	PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC2_PCH;
	uint32_t	PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC3_PCH;
	uint32_t	PCH_CON_NS_SYSTEM_LHM_D0_TRIP_PCH;
	uint32_t	PCH_CON_NS_SYSTEM_LHM_D1_TRIP_PCH;
	uint32_t	QCH_CON_CORE_GT_CMU_CORE_GT_QCH;
	uint32_t	QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC0_QCH;
	uint32_t	QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC1_QCH;
	uint32_t	QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC2_QCH;
	uint32_t	QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC3_QCH;
	uint32_t	QCH_CON_NS_CORE_TRIP_MMU_P_CORE_TRIP_MMU_QCH;
	uint32_t	QCH_CON_NS_CORE_TRIP_MMU_TCU_TRIP0_LPI;
	uint32_t	QCH_CON_NS_CORE_TRIP_MMU_TCU_TRIP1_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_LHM_D0_TRIP_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_LHM_D1_TRIP_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_GROUP_CPU_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_GROUP_GT_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_GROUP_MIFL_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_GROUP_MIFR_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_GROUP_MM_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_MIFL_P_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_PNOC_MIFR_P_QCH;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP0_CG_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP0_MST_BR_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP0_PD_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP0_SLV_BR_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP1_CG_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP1_MST_BR_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP1_PD_LPI;
	uint32_t	QCH_CON_NS_SYSTEM_TBU0_TRIP1_SLV_BR_LPI;
	uint32_t	QCH_CON_SYSREG_CORE_SYSREG_CORE_QCH;
	uint8_t		res11[0xb80];
	uint32_t	QUEUE_CTRL_REG_BLK_CORE_GT_CMU_CORE_GT;
	uint8_t		res12[0x3fc];
	uint32_t	DBG_NFO_PLL_CORE_GT;
	uint8_t		res13[0x80c];
	uint32_t	DBG_NFO_BLK_CORE_GT_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_CORE_GT_CMU_CLKOUT1;
	uint8_t		res14[0x7e8];
	uint32_t	DBG_NFO_CLK_CORE_NOC;
	uint32_t	DBG_NFO_CLK_CORE_PCLK;
	uint32_t	DBG_NFO_CLK_CORE_TRIP_MUX;
	uint8_t		res15[0x7f4];
	uint32_t	DBG_NFO_CLK_CORE_TCU;
	uint32_t	DBG_NFO_DIV_CLK_CORE_ATB;
	uint32_t	DBG_NFO_DIV_MIF_SWITCHCLK;
	uint32_t	DBG_NFO_PLL_CORE_DIV4;
	uint8_t		res16[0x7f0];
	uint32_t	DBG_NFO_CLK_BLK_CORE_GT_UID_CORE_GT_CMU_CORE_GT_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GATE_MIF_SWITCHCLK;
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_AXI2APB_CORE_IPCLKPORT_ACLK;
	uint8_t		res17[0x8];
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_LHS_ATB_CCC_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_NS_CORE_GROUP_GT_IPCLKPORT_CLK__PNOC_GROUP_3__REGBUS;
	uint8_t		res18[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_NS_CORE_TRIP_MMU_IPCLKPORT_CLK__P_CORE_TRIP_MMU__CLK_TRIPBU;
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_NS_CORE_TRIP_MMU_IPCLKPORT_CLK__P_CORE_TRIP_MMU__CLK_TRIPBU_P;
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_NS_SYSTEM_IPCLKPORT_CLK__SYSTEM__NOC;
	uint8_t		res19[0x10];
	uint32_t	DBG_NFO_GOUT_BLK_CORE_GT_UID_SYSREG_CORE_IPCLKPORT_PCLK;
	uint8_t		res20[0xfc0];
	uint32_t	DBG_NFO_PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC0_PCH;
	uint32_t	DBG_NFO_PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC1_PCH;
	uint32_t	DBG_NFO_PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC2_PCH;
	uint32_t	DBG_NFO_PCH_CON_LHS_ATB_CCC_LHS_ATB_CCC3_PCH;
	uint32_t	DBG_NFO_PCH_CON_NS_SYSTEM_LHM_D0_TRIP_PCH;
	uint32_t	DBG_NFO_PCH_CON_NS_SYSTEM_LHM_D1_TRIP_PCH;
	uint32_t	DBG_NFO_QCH_CON_CORE_GT_CMU_CORE_GT_QCH;
	uint32_t	DBG_NFO_QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC0_QCH;
	uint32_t	DBG_NFO_QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC1_QCH;
	uint32_t	DBG_NFO_QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC2_QCH;
	uint32_t	DBG_NFO_QCH_CON_LHS_ATB_CCC_LHS_ATB_CCC3_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_CORE_TRIP_MMU_P_CORE_TRIP_MMU_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_CORE_TRIP_MMU_TCU_TRIP0_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_CORE_TRIP_MMU_TCU_TRIP1_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_LHM_D0_TRIP_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_LHM_D1_TRIP_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_GROUP_CPU_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_GROUP_GT_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_GROUP_MIFL_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_GROUP_MIFR_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_GROUP_MM_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_MIFL_P_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_PNOC_MIFR_P_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP0_CG_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP0_MST_BR_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP0_PD_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP0_SLV_BR_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP1_CG_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP1_MST_BR_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP1_PD_LPI;
	uint32_t	DBG_NFO_QCH_CON_NS_SYSTEM_TBU0_TRIP1_SLV_BR_LPI;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_CORE_SYSREG_CORE_QCH;
};

struct cmu_core_mif {
	uint32_t PLL_LOCKTIME_PLL_CORE_MIFL	;/* 0x0 */
	uint32_t reserved_0[79];
	uint32_t PLL_CON0_PLL_CORE_MIFL	;/* 0x140 */
	uint32_t PLL_CON1_PLL_CORE_MIFL	;/* 0x144 */
	uint32_t PLL_CON2_PLL_CORE_MIFL	;/* 0x148 */
	uint32_t reserved_1[1];
	uint32_t PLL_CON4_PLL_CORE_MIFL	;/* 0x150 */
	uint32_t reserved_2[427];
	uint32_t CORE_MIFL_CMU_CONTROLLER_OPTION	;/* 0x800 */
	uint32_t reserved_3[3];
	uint32_t CLKOUT_CON_BLK_CORE_MIFL_CMU_CLKOUT0	;/* 0x810 */
	uint32_t CLKOUT_CON_BLK_CORE_MIFL_CMU_CLKOUT1	;/* 0x814 */
	uint32_t reserved_4[506];
	uint32_t CLK_CON_MUX_PLL_MIFL_CLK	;/* 0x1000 */
	uint32_t reserved_5[1026];
	uint32_t CLK_CON_GAT_CLK_BLK_CORE_MIFL_UID_CORE_MIFL_CMU_CORE_MIFL_IPCLKPORT_PCLK	;/* 0x200c */
	uint32_t reserved_6[1020];
	uint32_t DMYQCH_CON_AXI2APB_CORE_MIFL_QCH_DUMMY_AX2APB	;/* 0x3000 */
	uint32_t QCH_CON_CORE_MIFL_CMU_CORE_MIFL_QCH	;/* 0x3004 */
	uint32_t reserved_7[766];
	uint32_t QUEUE_CTRL_REG_BLK_CORE_MIFL_CMU_CORE_MIFL	;/* 0x3c00 */
	/* LAST ADDR = 0x3c00 */
};

struct cmu_cpucl {
	uint32_t PLL_LOCKTIME_PLL_CPUCL	;/* 0x0 */
	uint32_t CUSTOM_SFR_CPUCL0_SHORTSTOP	;/* 0x4 */
	uint32_t CUSTOM_SFR_CPUCL1_SHORTSTOP	;/* 0x8 */
	uint32_t CUSTOM_SFR_CPUCL2_SHORTSTOP	;/* 0xc */
	uint32_t CPUCL0_DROOPDETECTOR	;/* 0x10 */
	uint32_t CPUCL1_DROOPDETECTOR	;/* 0x14 */
	uint32_t CPUCL2_DROOPDETECTOR	;/* 0x18 */
	uint32_t reserved_0[65];
	uint32_t PLL_CON0_CPUCL_SWITCHCLK_MUX	;/* 0x120 */
	uint32_t PLL_CON1_CPUCL_SWITCHCLK_MUX	;/* 0x124 */
	uint32_t PLL_CON2_CPUCL_SWITCHCLK_MUX	;/* 0x128 */
	uint32_t reserved_1[5];
	uint32_t PLL_CON0_PLL_CPUCL	;/* 0x140 */
	uint32_t PLL_CON1_PLL_CPUCL	;/* 0x144 */
	uint32_t PLL_CON2_PLL_CPUCL	;/* 0x148 */
	uint32_t reserved_2[1];
	uint32_t PLL_CON4_PLL_CPUCL	;/* 0x150 */
	uint32_t reserved_3[427];
	uint32_t CPUCL_CMU_CONTROLLER_OPTION	;/* 0x800 */
	uint32_t reserved_4[3];
	uint32_t CLKOUT_CON_BLK_CPUCL_CMU_CLKOUT0	;/* 0x810 */
	uint32_t CLKOUT_CON_BLK_CPUCL_CMU_CLKOUT1	;/* 0x814 */
	uint32_t reserved_5[506];
	uint32_t CLK_CON_MUX_CLK_CLUSTER_CLK_MUX	;/* 0x1000 */
	uint32_t reserved_6[511];
	uint32_t CLK_CON_DIV_CLK_CLUSTER_CLK	;/* 0x1800 */
	uint32_t CLK_CON_DIV_CLK_CPUCL_DROOP_DETECTOR	;/* 0x1804 */
	uint32_t CLK_CON_DIV_CPUCL_CMUREF_CLK	;/* 0x1808 */
	uint32_t CLK_CON_DIV_CPUCL_HPM	;/* 0x180c */
	uint32_t CLK_CON_DIV_CPUCL_PCLK	;/* 0x1810 */
	uint32_t CLK_CON_DIV_CPUCL_PCLK_DD	;/* 0x1814 */
	uint32_t CLK_CON_DIV_DIV_CLK_CPUCL0_CPU	;/* 0x1818 */
	uint32_t CLK_CON_DIV_DIV_CLK_CPUCL1_CPU	;/* 0x181c */
	uint32_t CLK_CON_DIV_DIV_CLK_CPUCL2_CPU	;/* 0x1820 */
	uint32_t CLK_CON_DIV_DIV_CPUCL0_ACLK	;/* 0x1824 */
	uint32_t CLK_CON_DIV_DIV_CPUCL0_ADB400	;/* 0x1828 */
	uint32_t CLK_CON_DIV_DIV_CPUCL0_ATCLK	;/* 0x182c */
	uint32_t CLK_CON_DIV_DIV_CPUCL0_CNTCLK	;/* 0x1830 */
	uint32_t CLK_CON_DIV_DIV_CPUCL0_PCLKDBG	;/* 0x1834 */
	uint32_t CLK_CON_DIV_DIV_CPUCL1_ACLK	;/* 0x1838 */
	uint32_t CLK_CON_DIV_DIV_CPUCL1_ADB400	;/* 0x183c */
	uint32_t CLK_CON_DIV_DIV_CPUCL1_ATCLK	;/* 0x1840 */
	uint32_t CLK_CON_DIV_DIV_CPUCL1_CNTCLK	;/* 0x1844 */
	uint32_t CLK_CON_DIV_DIV_CPUCL1_PCLKDBG	;/* 0x1848 */
	uint32_t CLK_CON_DIV_DIV_CPUCL2_ACLK	;/* 0x184c */
	uint32_t CLK_CON_DIV_DIV_CPUCL2_ADB400	;/* 0x1850 */
	uint32_t CLK_CON_DIV_DIV_CPUCL2_ATCLK	;/* 0x1854 */
	uint32_t CLK_CON_DIV_DIV_CPUCL2_CNTCLK	;/* 0x1858 */
	uint32_t CLK_CON_DIV_DIV_CPUCL2_PCLKDBG	;/* 0x185c */
	uint32_t reserved_7[488];
	uint32_t CLK_CON_BUF_BOUT_OSCCLK_CPUCL	;/* 0x2000 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_BUSIF_HPMCPUCL_IPCLKPORT_CLK	;/* 0x2004 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER0_IPCLKPORT_CLK	;/* 0x2008 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER0_IPCLKPORT_PCLKDBG	;/* 0x200c */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER1_IPCLKPORT_CLK	;/* 0x2010 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER1_IPCLKPORT_PCLKDBG	;/* 0x2014 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER2_IPCLKPORT_CLK	;/* 0x2018 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CLUSTER2_IPCLKPORT_PCLKDBG	;/* 0x201c */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_CPUCL_CMU_CPUCL_IPCLKPORT_PCLK	;/* 0x2020 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL0_IPCLKPORT_CK_IN	;/* 0x2024 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL1_IPCLKPORT_CK_IN	;/* 0x2028 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL2_IPCLKPORT_CK_IN	;/* 0x202c */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL0_IPCLKPORT_CK_IN	;/* 0x2030 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL1_IPCLKPORT_CK_IN	;/* 0x2034 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL2_IPCLKPORT_CK_IN	;/* 0x2038 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL0_IPCLKPORT_CK_IN	;/* 0x203c */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL1_IPCLKPORT_CK_IN	;/* 0x2040 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL2_IPCLKPORT_CK_IN	;/* 0x2044 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL0_IPCLKPORT_CK_IN	;/* 0x2048 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL1_IPCLKPORT_CK_IN	;/* 0x204c */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL2_IPCLKPORT_CK_IN	;/* 0x2050 */
	uint32_t CLK_CON_GAT_CLK_BLK_CPUCL_UID_HPM_CPUCL_IPCLKPORT_I_HPM_TARGETCLK_C	;/* 0x2054 */
	uint32_t CLK_CON_GAT_CPUCL_HPM_GATE	;/* 0x2058 */
	uint32_t CLK_CON_GAT_CPUCL_PCLK_GATE	;/* 0x205c */
	uint32_t CLK_CON_GAT_GATE_CLUSTER_CLK	;/* 0x2060 */
	uint32_t CLK_CON_GAT_GATE_CPUCL0_ACLK	;/* 0x2064 */
	uint32_t CLK_CON_GAT_GATE_CPUCL0_ADB400	;/* 0x2068 */
	uint32_t CLK_CON_GAT_GATE_CPUCL0_ATCLK	;/* 0x206c */
	uint32_t CLK_CON_GAT_GATE_CPUCL0_CNTCLK	;/* 0x2070 */
	uint32_t CLK_CON_GAT_GATE_CPUCL0_PCLKDBG	;/* 0x2074 */
	uint32_t CLK_CON_GAT_GATE_CPUCL1_ACLK	;/* 0x2078 */
	uint32_t CLK_CON_GAT_GATE_CPUCL1_ADB400	;/* 0x207c */
	uint32_t CLK_CON_GAT_GATE_CPUCL1_ATCLK	;/* 0x2080 */
	uint32_t CLK_CON_GAT_GATE_CPUCL1_CNTCLK	;/* 0x2084 */
	uint32_t CLK_CON_GAT_GATE_CPUCL1_PCLKDBG	;/* 0x2088 */
	uint32_t CLK_CON_GAT_GATE_CPUCL2_ACLK	;/* 0x208c */
	uint32_t CLK_CON_GAT_GATE_CPUCL2_ADB400	;/* 0x2090 */
	uint32_t CLK_CON_GAT_GATE_CPUCL2_ATCLK	;/* 0x2094 */
	uint32_t CLK_CON_GAT_GATE_CPUCL2_CNTCLK	;/* 0x2098 */
	uint32_t CLK_CON_GAT_GATE_CPUCL2_PCLKDBG	;/* 0x209c */
	uint32_t CLK_CON_GAT_GATE_CPUCL_CMUREF_CLK	;/* 0x20a0 */
	uint32_t CLK_CON_GAT_GATE_CPUCL_DROOP_DETECTOR	;/* 0x20a4 */
	uint32_t CLK_CON_GAT_GATE_CPUCL_PCLK_DD	;/* 0x20a8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_APB_G_CLUSTER0_IPCLKPORT_PCLKM	;/* 0x20ac */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_APB_G_CLUSTER1_IPCLKPORT_PCLKM	;/* 0x20b0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_APB_G_CLUSTER2_IPCLKPORT_PCLKM	;/* 0x20b4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_AXI4ST_I_CPUCL0_IPCLKPORT_ACLKM	;/* 0x20b8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_AXI4ST_I_CPUCL1_IPCLKPORT_ACLKM	;/* 0x20bc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADM_AXI4ST_I_CPUCL2_IPCLKPORT_ACLKM	;/* 0x20c0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADS_AXI4ST_I_CPUCL0_IPCLKPORT_ACLKS	;/* 0x20c4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADS_AXI4ST_I_CPUCL1_IPCLKPORT_ACLKS	;/* 0x20c8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ADS_AXI4ST_I_CPUCL2_IPCLKPORT_ACLKS	;/* 0x20cc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL0_IPCLKPORT_PCLKM	;/* 0x20d0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL0_IPCLKPORT_PCLKS	;/* 0x20d4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL1_IPCLKPORT_PCLKM	;/* 0x20d8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL1_IPCLKPORT_PCLKS	;/* 0x20dc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL2_IPCLKPORT_PCLKM	;/* 0x20e0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_DUMP_PC_CPUCL2_IPCLKPORT_PCLKS	;/* 0x20e4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL0_IPCLKPORT_PCLKM	;/* 0x20e8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL0_IPCLKPORT_PCLKS	;/* 0x20ec */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL1_IPCLKPORT_PCLKM	;/* 0x20f0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL1_IPCLKPORT_PCLKS	;/* 0x20f4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL2_IPCLKPORT_PCLKM	;/* 0x20f8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR0_CPUCL2_IPCLKPORT_PCLKS	;/* 0x20fc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL0_IPCLKPORT_PCLKM	;/* 0x2100 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL0_IPCLKPORT_PCLKS	;/* 0x2104 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL1_IPCLKPORT_PCLKM	;/* 0x2108 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL1_IPCLKPORT_PCLKS	;/* 0x210c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL2_IPCLKPORT_PCLKM	;/* 0x2110 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR1_CPUCL2_IPCLKPORT_PCLKS	;/* 0x2114 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL0_IPCLKPORT_PCLKM	;/* 0x2118 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL0_IPCLKPORT_PCLKS	;/* 0x211c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL1_IPCLKPORT_PCLKM	;/* 0x2120 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL1_IPCLKPORT_PCLKS	;/* 0x2124 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL2_IPCLKPORT_PCLKM	;/* 0x2128 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR2_CPUCL2_IPCLKPORT_PCLKS	;/* 0x212c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL0_IPCLKPORT_PCLKM	;/* 0x2130 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL0_IPCLKPORT_PCLKS	;/* 0x2134 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL1_IPCLKPORT_PCLKM	;/* 0x2138 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL1_IPCLKPORT_PCLKS	;/* 0x213c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL2_IPCLKPORT_PCLKM	;/* 0x2140 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AD_APB_D_DETECTOR3_CPUCL2_IPCLKPORT_PCLKS	;/* 0x2144 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI0_CLUSTER0_IPCLKPORT_I_CLK	;/* 0x2148 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI0_CLUSTER1_IPCLKPORT_I_CLK	;/* 0x214c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI0_CLUSTER2_IPCLKPORT_I_CLK	;/* 0x2150 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI1_CLUSTER0_IPCLKPORT_I_CLK	;/* 0x2154 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI1_CLUSTER1_IPCLKPORT_I_CLK	;/* 0x2158 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI1_CLUSTER2_IPCLKPORT_I_CLK	;/* 0x215c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI2_CLUSTER0_IPCLKPORT_I_CLK	;/* 0x2160 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI2_CLUSTER1_IPCLKPORT_I_CLK	;/* 0x2164 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI2_CLUSTER2_IPCLKPORT_I_CLK	;/* 0x2168 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI3_CLUSTER0_IPCLKPORT_I_CLK	;/* 0x216c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI3_CLUSTER1_IPCLKPORT_I_CLK	;/* 0x2170 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_ASYNC_ATB_SI3_CLUSTER2_IPCLKPORT_I_CLK	;/* 0x2174 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AXI2APB_CPUCL_S0_IPCLKPORT_ACLK	;/* 0x2178 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_AXI2APB_CPUCL_S1_IPCLKPORT_ACLK	;/* 0x217c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_BUSIF_HPMCPUCL_IPCLKPORT_PCLK	;/* 0x2180 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_BUS_P_CPUCL_IPCLKPORT_MAINCLK	;/* 0x2184 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL0_IPCLKPORT_PCLK	;/* 0x2188 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL1_IPCLKPORT_PCLK	;/* 0x218c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR0_CPUCL2_IPCLKPORT_PCLK	;/* 0x2190 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL0_IPCLKPORT_PCLK	;/* 0x2194 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL1_IPCLKPORT_PCLK	;/* 0x2198 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR1_CPUCL2_IPCLKPORT_PCLK	;/* 0x219c */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL0_IPCLKPORT_PCLK	;/* 0x21a0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL1_IPCLKPORT_PCLK	;/* 0x21a4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR2_CPUCL2_IPCLKPORT_PCLK	;/* 0x21a8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL0_IPCLKPORT_PCLK	;/* 0x21ac */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL1_IPCLKPORT_PCLK	;/* 0x21b0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DROOP_DETECTOR3_CPUCL2_IPCLKPORT_PCLK	;/* 0x21b4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DUMP_PC_CPUCL0_IPCLKPORT_I_PCLK	;/* 0x21b8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DUMP_PC_CPUCL1_IPCLKPORT_I_PCLK	;/* 0x21bc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_DUMP_PC_CPUCL2_IPCLKPORT_I_PCLK	;/* 0x21c0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_NS_BRDG_CPUCL_IPCLKPORT_CLK__PCPUCL__CLK_CPUCL_D1	;/* 0x21c4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_NS_BRDG_CPUCL_IPCLKPORT_CLK__PCPUCL__CLK_CPUCL_D2	;/* 0x21c8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_NS_BRDG_CPUCL_IPCLKPORT_CLK__PCPUCL__CLK_CPUCL_D3	;/* 0x21cc */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_NS_BRDG_CPUCL_IPCLKPORT_CLK__PCPUCL__CLK_CPUCL_P	;/* 0x21d0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_SYSREG_CPUCL0_IPCLKPORT_PCLK	;/* 0x21d4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_SYSREG_CPUCL1_IPCLKPORT_PCLK	;/* 0x21d8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_CPUCL_UID_SYSREG_CPUCL2_IPCLKPORT_PCLK	;/* 0x21dc */
	uint32_t CLK_CON_GAT_SHORTSTOP_CPUCL0_GATE	;/* 0x21e0 */
	uint32_t CLK_CON_GAT_SHORTSTOP_CPUCL1_GATE	;/* 0x21e4 */
	uint32_t CLK_CON_GAT_SHORTSTOP_CPUCL2_GATE	;/* 0x21e8 */
	uint32_t reserved_8[901];
	uint32_t DMYQCH_CON_CLUSTER0_QCH_DUMMY_CLUSTER0	;/* 0x3000 */
	uint32_t DMYQCH_CON_CLUSTER1_QCH_DUMMY_CLUSTER1	;/* 0x3004 */
	uint32_t DMYQCH_CON_CLUSTER2_QCH_DUMMY_CLUSTER2	;/* 0x3008 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR0_CPUCL0_QCH_DUMMY_DD0_CPUCL0	;/* 0x300c */
	uint32_t DMYQCH_CON_DROOP_DETECTOR0_CPUCL1_QCH_DUMMY_DD0_CPUCL1	;/* 0x3010 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR0_CPUCL2_QCH_DUMMY_DD0_CPUCL2	;/* 0x3014 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR1_CPUCL0_QCH_DUMMY_DD1_CPUCL0	;/* 0x3018 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR1_CPUCL1_QCH_DUMMY_DD1_CPUCL1	;/* 0x301c */
	uint32_t DMYQCH_CON_DROOP_DETECTOR1_CPUCL2_QCH_DUMMY_DD1_CPUCL2	;/* 0x3020 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR2_CPUCL0_QCH_DUMMY_DD2_CPUCL0	;/* 0x3024 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR2_CPUCL1_QCH_DUMMY_DD2_CPUCL1	;/* 0x3028 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR2_CPUCL2_QCH_DUMMY_DD2_CPUCL2	;/* 0x302c */
	uint32_t DMYQCH_CON_DROOP_DETECTOR3_CPUCL0_QCH_DUMMY_DD3_CPUCL0	;/* 0x3030 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR3_CPUCL1_QCH_DUMMY_DD3_CPUCL1	;/* 0x3034 */
	uint32_t DMYQCH_CON_DROOP_DETECTOR3_CPUCL2_QCH_DUMMY_DD3_CPUCL2	;/* 0x3038 */
	uint32_t DMYQCH_CON_DUMMY_SHORTSTOP_QCH_DUMMY_SHORTSTOP	;/* 0x303c */
	uint32_t LPI_CON_BUS_P_CPUCL_CD_MAIN	;/* 0x3040 */
	uint32_t PCH_CON_ASYNC_ATB_SI0_CLUSTER0_PCH_S_LH	;/* 0x3044 */
	uint32_t PCH_CON_ASYNC_ATB_SI0_CLUSTER1_PCH_S_LH	;/* 0x3048 */
	uint32_t PCH_CON_ASYNC_ATB_SI0_CLUSTER2_PCH_S_LH	;/* 0x304c */
	uint32_t PCH_CON_ASYNC_ATB_SI1_CLUSTER0_PCH_S_LH	;/* 0x3050 */
	uint32_t PCH_CON_ASYNC_ATB_SI1_CLUSTER1_PCH_S_LH	;/* 0x3054 */
	uint32_t PCH_CON_ASYNC_ATB_SI1_CLUSTER2_PCH_S_LH	;/* 0x3058 */
	uint32_t PCH_CON_ASYNC_ATB_SI2_CLUSTER0_PCH_S_LH	;/* 0x305c */
	uint32_t PCH_CON_ASYNC_ATB_SI2_CLUSTER1_PCH_S_LH	;/* 0x3060 */
	uint32_t PCH_CON_ASYNC_ATB_SI2_CLUSTER2_PCH_S_LH	;/* 0x3064 */
	uint32_t PCH_CON_ASYNC_ATB_SI3_CLUSTER0_PCH_S_LH	;/* 0x3068 */
	uint32_t PCH_CON_ASYNC_ATB_SI3_CLUSTER1_PCH_S_LH	;/* 0x306c */
	uint32_t PCH_CON_ASYNC_ATB_SI3_CLUSTER2_PCH_S_LH	;/* 0x3070 */
	uint32_t QCH_CON_ADM_AXI4ST_I_CPUCL0_QCH_CLK_MST	;/* 0x3074 */
	uint32_t QCH_CON_ADM_AXI4ST_I_CPUCL1_QCH_CLK_MST	;/* 0x3078 */
	uint32_t QCH_CON_ADM_AXI4ST_I_CPUCL2_QCH_CLK_MST	;/* 0x307c */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL0_QCH_CLK_SLV	;/* 0x3080 */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL0_QCH_PWR_SLV	;/* 0x3084 */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL1_QCH_CLK_SLV	;/* 0x3088 */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL1_QCH_PWR_SLV	;/* 0x308c */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL2_QCH_CLK_SLV	;/* 0x3090 */
	uint32_t QCH_CON_ADS_AXI4ST_I_CPUCL2_QCH_PWR_SLV	;/* 0x3094 */
	uint32_t QCH_CON_ASYNC_ATB_SI0_CLUSTER0_QCH_S_LHS	;/* 0x3098 */
	uint32_t QCH_CON_ASYNC_ATB_SI0_CLUSTER1_QCH_S_LHS	;/* 0x309c */
	uint32_t QCH_CON_ASYNC_ATB_SI0_CLUSTER2_QCH_S_LHS	;/* 0x30a0 */
	uint32_t QCH_CON_ASYNC_ATB_SI1_CLUSTER0_QCH_S_LHS	;/* 0x30a4 */
	uint32_t QCH_CON_ASYNC_ATB_SI1_CLUSTER1_QCH_S_LHS	;/* 0x30a8 */
	uint32_t QCH_CON_ASYNC_ATB_SI1_CLUSTER2_QCH_S_LHS	;/* 0x30ac */
	uint32_t QCH_CON_ASYNC_ATB_SI2_CLUSTER0_QCH_S_LHS	;/* 0x30b0 */
	uint32_t QCH_CON_ASYNC_ATB_SI2_CLUSTER1_QCH_S_LHS	;/* 0x30b4 */
	uint32_t QCH_CON_ASYNC_ATB_SI2_CLUSTER2_QCH_S_LHS	;/* 0x30b8 */
	uint32_t QCH_CON_ASYNC_ATB_SI3_CLUSTER0_QCH_S_LHS	;/* 0x30bc */
	uint32_t QCH_CON_ASYNC_ATB_SI3_CLUSTER1_QCH_S_LHS	;/* 0x30c0 */
	uint32_t QCH_CON_ASYNC_ATB_SI3_CLUSTER2_QCH_S_LHS	;/* 0x30c4 */
	uint32_t QCH_CON_BUSIF_HPMCPUCL_QCH_S_HPM_APBIF0	;/* 0x30c8 */
	uint32_t QCH_CON_CPUCL_CMU_CPUCL_QCH	;/* 0x30cc */
	uint32_t QCH_CON_DUMP_PC_CPUCL0_QCH00_S	;/* 0x30d0 */
	uint32_t QCH_CON_DUMP_PC_CPUCL1_QCH00_S	;/* 0x30d4 */
	uint32_t QCH_CON_DUMP_PC_CPUCL2_QCH00_S	;/* 0x30d8 */
	uint32_t QCH_CON_NS_BRDG_CPUCL_PCPUCL_QCH	;/* 0x30dc */
	uint32_t QCH_CON_SYSREG_CPUCL0_QCH00_S	;/* 0x30e0 */
	uint32_t QCH_CON_SYSREG_CPUCL1_QCH00_S	;/* 0x30e4 */
	uint32_t QCH_CON_SYSREG_CPUCL2_QCH00_S	;/* 0x30e8 */
	uint32_t reserved_9[709];
	uint32_t QUEUE_CTRL_REG_BLK_CPUCL_CMU_CPUCL	;/* 0x3c00 */
	/* LAST ADDR = 0x3c00 */
};

struct cmu_fsys0 {
	uint8_t		res0[0x100];
	uint32_t	PLL_CON0_CLKCMU_FSYS0_UNIPRO;
	uint32_t	PLL_CON1_CLKCMU_FSYS0_UNIPRO;
	uint32_t	PLL_CON2_CLKCMU_FSYS0_UNIPRO;
	uint8_t		res1[0x34];
	uint32_t	PLL_CON0_CLK_FSYS0_SLAVEBUSCLK;
	uint32_t	PLL_CON1_CLK_FSYS0_SLAVEBUSCLK;
	uint32_t	PLL_CON2_CLK_FSYS0_SLAVEBUSCLK;
	uint8_t		res2[0x14];
	uint32_t	PLL_CON0_EQOS_RGMII_125_MUX1;
	uint32_t	PLL_CON1_EQOS_RGMII_125_MUX1;
	uint32_t	PLL_CON2_EQOS_RGMII_125_MUX1;
	uint8_t		res3[0x694];
	uint32_t	FSYS0_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_FSYS0_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_FSYS0_CMU_CLKOUT1;
	uint8_t		res5[0xfe8];
	uint32_t	CLK_CON_DIV_DIV_CLK_UNIPRO;
	uint32_t	CLK_CON_DIV_DIV_EQS_RGMII_CLK_125;
	uint32_t	CLK_CON_DIV_DIV_PERIBUS_GRP;
	uint32_t	CLK_CON_DIV_EQOS_RII_CLK2O5;
	uint32_t	CLK_CON_DIV_EQOS_RMIICLK_25;
	uint32_t	CLK_CON_DIV_PCIE_PHY_OSCCLK;
	uint8_t		res6[0x7ec];
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_CLK_PTP_REF_I;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_CLK_RX_I;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_FSYS0_CMU_FSYS0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_GPIO_FSYS0_IPCLKPORT_OSCCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_PLL_REFCLK_FROM_XO;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_PIPE_PAL_INST_0_I_IMMORTAL_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_AUX_CLK_SOC;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_MPHY_REFCLK_IXTAL24;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_MPHY_REFCLK_IXTAL26;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_MPHY_REFCLK_IXTAL24;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_MPHY_REFCLK_IXTAL26;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_REF_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_USB20_CLKCORE_0;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_AHBBR_FSYS0_IPCLKPORT_HCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_AXI2APB_FSYS0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_BUS_D_FSYS0_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_BUS_D_FSYS0_IPCLKPORT_PERICLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_BUS_P_FSYS0_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_BUS_P_FSYS0_IPCLKPORT_TCUCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_CPE425_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_ACLK_I;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_HCLK_I;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RGMII_CLK_I;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RII_CLK_I;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RMII_CLK_I;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_GPIO_FSYS0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_D1;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_S;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_I_APB_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_PLL_REFCLK_FROM_SYSPLL;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_PIPE_PAL_INST_0_I_APB_PCLK_0;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_DBI_ACLK_SOC;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_I_DRIVER_APB_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_MSTR_ACLK_SOC;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_SLV_ACLK_SOC;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_SMMU_FSYS0_IPCLKPORT_CCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_SMMU_FSYS0_IPCLKPORT_FSYS0_BCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_SYSREG_FSYS0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_HCLK_BUS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_CLK_UNIPRO;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_FMP_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_HCLK_BUS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_CLK_UNIPRO;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_FMP_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_BUS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_BUS_PHYCTRL;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_PHYCTRL;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_BUS_CLK_EARLY;
	uint32_t	CLK_CON_GAT_RII_CLK_DIVGATE;
	uint8_t		res7[0xf28];
	uint32_t	DMYQCH_CON_EQOS_TOP0_QCH_DUMMY_EQOS;
	uint32_t	DMYQCH_CON_PCIE_TOP_QCH_DUMMY_PCIE;
	uint32_t	DMYQCH_CON_UFS_TOP0_QCH_DUMMY_UFS0_MPHY;
	uint32_t	DMYQCH_CON_UFS_TOP1_QCH_DUMMY_UFS1_MPHY;
	uint32_t	LPI_CON_BUS_D_FSYS0_LPI_BUS_MAIN;
	uint32_t	LPI_CON_BUS_D_FSYS0_LPI_PERI;
	uint32_t	LPI_CON_BUS_P_FSYS0_LPI_MAINCLK;
	uint32_t	LPI_CON_BUS_P_FSYS0_LPI_TCU;
	uint32_t	LPI_CON_EQOS_TOP0_LPI_BUS;
	uint32_t	LPI_CON_UFS_TOP0_LPI_ACLK;
	uint32_t	LPI_CON_UFS_TOP1_LPI_ACLK;
	uint32_t	QCH_CON_CPE425_QCH_CPE0;
	uint32_t	QCH_CON_FSYS0_CMU_FSYS0_QCH;
	uint32_t	QCH_CON_GPIO_FSYS0_QCH_GPIO;
	uint32_t	QCH_CON_NS_BRDG_FSYS0_PSOC_FSYS0_QCH;
	uint32_t	QCH_CON_SMMU_FSYS0_LPI_TBU_CG;
	uint32_t	QCH_CON_SMMU_FSYS0_LPI_TBU_MST_BR;
	uint32_t	QCH_CON_SMMU_FSYS0_LPI_TBU_PD;
	uint32_t	QCH_CON_SMMU_FSYS0_LPI_TBU_SLV_BR;
	uint32_t	QCH_CON_SMMU_FSYS0_LPI_TCU;
	uint32_t	QCH_CON_SYSREG_FSYS0_QCH;
	uint32_t	QCH_CON_UFS_TOP0_QCH_FMP_CLK;
	uint32_t	QCH_CON_UFS_TOP0_QCH_UFS0_HCLK;
	uint32_t	QCH_CON_UFS_TOP1_QCH_FMP_CLK;
	uint32_t	QCH_CON_UFS_TOP1_QCH_UFS1_HCLK;
	uint32_t	QCH_CON_USB20DRD_QCH_ACLKBUS;
	uint32_t	QCH_CON_USB20DRD_QCH_BUSPHYCTRL;
	uint8_t		res8[0xb94];
	uint32_t	QUEUE_CTRL_REG_BLK_FSYS0_CMU_FSYS0;
	uint8_t		res9[0x3fc];
	uint32_t	DBG_NFO_CLKCMU_FSYS0_UNIPRO;
	uint8_t		res10[0x3c];
	uint32_t	DBG_NFO_CLK_FSYS0_SLAVEBUSCLK;
	uint8_t		res11[0x1c];
	uint32_t	DBG_NFO_EQOS_RGMII_125_MUX1;
	uint8_t		res12[0x7ac];
	uint32_t	DBG_NFO_BLK_FSYS0_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_FSYS0_CMU_CLKOUT1;
	uint8_t		res13[0xfe8];
	uint32_t	DBG_NFO_DIV_CLK_UNIPRO;
	uint32_t	DBG_NFO_DIV_EQS_RGMII_CLK_125;
	uint32_t	DBG_NFO_DIV_PERIBUS_GRP;
	uint32_t	DBG_NFO_EQOS_RII_CLK2O5;
	uint32_t	DBG_NFO_EQOS_RMIICLK_25;
	uint32_t	DBG_NFO_PCIE_PHY_OSCCLK;
	uint8_t		res14[0x7ec];
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_CLK_PTP_REF_I;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_CLK_RX_I;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_FSYS0_CMU_FSYS0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_GPIO_FSYS0_IPCLKPORT_OSCCLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_PLL_REFCLK_FROM_XO;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_PIPE_PAL_INST_0_I_IMMORTAL_CLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_AUX_CLK_SOC;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_MPHY_REFCLK_IXTAL24;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_MPHY_REFCLK_IXTAL26;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_MPHY_REFCLK_IXTAL24;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_MPHY_REFCLK_IXTAL26;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_REF_CLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_USB20_CLKCORE_0;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_AHBBR_FSYS0_IPCLKPORT_HCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_AXI2APB_FSYS0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_BUS_D_FSYS0_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_BUS_D_FSYS0_IPCLKPORT_PERICLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_BUS_P_FSYS0_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_BUS_P_FSYS0_IPCLKPORT_TCUCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_CPE425_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_ACLK_I;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_HCLK_I;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RGMII_CLK_I;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RII_CLK_I;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_EQOS_TOP0_IPCLKPORT_RMII_CLK_I;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_GPIO_FSYS0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_D;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_D1;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_P;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_NS_BRDG_FSYS0_IPCLKPORT_CLK__PSOC_FSYS0__CLK_FSYS0_S;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_I_APB_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_IEEE1500_WRAPPER_FOR_PCIEG3_PHY_X4_INST_0_PLL_REFCLK_FROM_SYSPLL;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_PIPE_PAL_INST_0_I_APB_PCLK_0;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_DBI_ACLK_SOC;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_I_DRIVER_APB_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_MSTR_ACLK_SOC;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_PCIE_TOP_IPCLKPORT_TRAV_PCIE_SUB_CTRL_INST_0_SLV_ACLK_SOC;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_SMMU_FSYS0_IPCLKPORT_CCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_SMMU_FSYS0_IPCLKPORT_FSYS0_BCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_SYSREG_FSYS0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_HCLK_BUS;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_CLK_UNIPRO;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP0_IPCLKPORT_I_FMP_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_HCLK_BUS;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_CLK_UNIPRO;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_UFS_TOP1_IPCLKPORT_I_FMP_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_BUS;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_BUS_PHYCTRL;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_ACLK_PHYCTRL;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS0_UID_USB20DRD_IPCLKPORT_BUS_CLK_EARLY;
	uint32_t	DBG_NFO_RII_CLK_DIVGATE;
	uint8_t		res15[0xf28];
	uint32_t	DBG_NFO_DMYQCH_CON_EQOS_TOP0_QCH_DUMMY_EQOS;
	uint32_t	DBG_NFO_DMYQCH_CON_PCIE_TOP_QCH_DUMMY_PCIE;
	uint32_t	DBG_NFO_DMYQCH_CON_UFS_TOP0_QCH_DUMMY_UFS0_MPHY;
	uint32_t	DBG_NFO_DMYQCH_CON_UFS_TOP1_QCH_DUMMY_UFS1_MPHY;
	uint32_t	DBG_NFO_LPI_CON_BUS_D_FSYS0_LPI_BUS_MAIN;
	uint32_t	DBG_NFO_LPI_CON_BUS_D_FSYS0_LPI_PERI;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_FSYS0_LPI_MAINCLK;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_FSYS0_LPI_TCU;
	uint32_t	DBG_NFO_LPI_CON_EQOS_TOP0_LPI_BUS;
	uint32_t	DBG_NFO_LPI_CON_UFS_TOP0_LPI_ACLK;
	uint32_t	DBG_NFO_LPI_CON_UFS_TOP1_LPI_ACLK;
	uint32_t	DBG_NFO_QCH_CON_CPE425_QCH_CPE0;
	uint32_t	DBG_NFO_QCH_CON_FSYS0_CMU_FSYS0_QCH;
	uint32_t	DBG_NFO_QCH_CON_GPIO_FSYS0_QCH_GPIO;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_FSYS0_PSOC_FSYS0_QCH;
	uint32_t	DBG_NFO_QCH_CON_SMMU_FSYS0_LPI_TBU_CG;
	uint32_t	DBG_NFO_QCH_CON_SMMU_FSYS0_LPI_TBU_MST_BR;
	uint32_t	DBG_NFO_QCH_CON_SMMU_FSYS0_LPI_TBU_PD;
	uint32_t	DBG_NFO_QCH_CON_SMMU_FSYS0_LPI_TBU_SLV_BR;
	uint32_t	DBG_NFO_QCH_CON_SMMU_FSYS0_LPI_TCU;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_FSYS0_QCH;
	uint32_t	DBG_NFO_QCH_CON_UFS_TOP0_QCH_FMP_CLK;
	uint32_t	DBG_NFO_QCH_CON_UFS_TOP0_QCH_UFS0_HCLK;
	uint32_t	DBG_NFO_QCH_CON_UFS_TOP1_QCH_FMP_CLK;
	uint32_t	DBG_NFO_QCH_CON_UFS_TOP1_QCH_UFS1_HCLK;
	uint32_t	DBG_NFO_QCH_CON_USB20DRD_QCH_ACLKBUS;
	uint32_t	DBG_NFO_QCH_CON_USB20DRD_QCH_BUSPHYCTRL;
};

struct cmu_fsys1 {
	uint8_t		res0[0x100];
	uint32_t	PLL_CON0_ACLK_FSYS1_BUSP_MUX;
	uint32_t	PLL_CON1_ACLK_FSYS1_BUSP_MUX;
	uint32_t	PLL_CON2_ACLK_FSYS1_BUSP_MUX;
	uint8_t		res1[0x74];
	uint32_t	PLL_CON0_PCLKL_FSYS1_BUSP_MUX;
	uint32_t	PLL_CON1_PCLKL_FSYS1_BUSP_MUX;
	uint32_t	PLL_CON2_PCLKL_FSYS1_BUSP_MUX;
	uint8_t		res2[0x674];
	uint32_t	FSYS1_CMU_CONTROLLER_OPTION;
	uint8_t		res3[0xc];
	uint32_t	CLKOUT_CON_BLK_FSYS1_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_FSYS1_CMU_CLKOUT1;
	uint8_t		res4[0xfe8];
	uint32_t	CLK_CON_DIV_CLK_FSYS1_PHY0_OSCCLK;
	uint32_t	CLK_CON_DIV_CLK_FSYS1_PHY1_OSCCLK;
	uint8_t		res5[0x7f8];
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS1_UID_FSYS1_CMU_FSYS1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_AUXCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_SOC_REF_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_AUXCLK;
	uint8_t		res6[0x1c];
	uint32_t	CLK_CON_GAT_CLK_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_REF_XTAL;
	uint8_t		res7[0x4];
	uint32_t	CLK_CON_GAT_GATE_CLK_FSYS1_PHY0_OSCCLLK;
	uint32_t	CLK_CON_GAT_GATE_CLK_FSYS1_PHY1_OSCCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_AXI2APB_FSYS1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_BUS_D0_FSYS1_IPCLKPORT_MAINCLK;
	uint8_t		res8[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_BUS_S0_FSYS1_IPCLKPORT_M250CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_BUS_S0_FSYS1_IPCLKPORT_MAINCLK;
	uint8_t		res9[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_CPE425_0_FSYS1_IPCLKPORT_ACLK;
	uint8_t		res10[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_NS_BRDG_FSYS1_IPCLKPORT_CLK__PSOC_FSYS1__CLK_FSYS1_D0;
	uint8_t		res11[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_NS_BRDG_FSYS1_IPCLKPORT_CLK__PSOC_FSYS1__CLK_FSYS1_S0;
	uint8_t		res12[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_DBI_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_APB_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_DRIVER_APB_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_MSTR_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_SLV_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_DBI_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_I_DRIVER_APB_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_MSTR_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_SLV_ACLK;
	uint8_t		res13[0x14];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_APB_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_REF_SOC_PLL;
	uint8_t		res14[0x8];
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_SYSREG_FSYS1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_FSYS1_UID_TBU0_FSYS1_IPCLKPORT_ACLK;
	uint8_t		res15[0xf44];
	uint32_t	DMYQCH_CON_PCIE_LINK0_QCH_DUMMY_LINK0;
	uint32_t	DMYQCH_CON_PCIE_LINK1_QCH_DUMMY_LINK1;
	uint8_t		res16[0x8];
	uint32_t	DMYQCH_CON_PCIE_PHY0_QCH_DUMMY_PHY0;
	uint8_t		res17[0x4];
	uint32_t	LPI_CON_BUS_D0_FSYS1_QCH_BUSD0;
	uint8_t		res18[0x4];
	uint32_t	LPI_CON_BUS_S0_FSYS1_LPI_M250CLK;
	uint32_t	LPI_CON_BUS_S0_FSYS1_LPI_MAINCLK;
	uint8_t		res19[0x34];
	uint32_t	QCH_CON_CPE425_0_FSYS1_QCH_CPE0;
	uint8_t		res20[0x4];
	uint32_t	QCH_CON_FSYS1_CMU_FSYS1_QCH;
	uint32_t	QCH_CON_NS_BRDG_FSYS1_PSOC_FSYS1_QCH;
	uint32_t	QCH_CON_SYSREG_FSYS1_QCH_FSYS1_SYSREG;
	uint32_t	QCH_CON_TBU0_FSYS1_QCH_S_CG;
	uint32_t	QCH_CON_TBU0_FSYS1_QCH_S_PG;
	uint32_t	QCH_CON_TBU0_FSYS1_QCH_S_PG_0;
	uint32_t	QCH_CON_TBU0_FSYS1_QCH_S_PG_1;
	uint8_t		res21[0xb80];
	uint32_t	QUEUE_CTRL_REG_BLK_FSYS1_CMU_FSYS1;
	uint8_t		res22[0x3fc];
	uint32_t	DBG_NFO_ACLK_FSYS1_BUSP_MUX;
	uint8_t		res23[0x7c];
	uint32_t	DBG_NFO_PCLKL_FSYS1_BUSP_MUX;
	uint8_t		res24[0x78c];
	uint32_t	DBG_NFO_BLK_FSYS1_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_FSYS1_CMU_CLKOUT1;
	uint8_t		res25[0xfe8];
	uint32_t	DBG_NFO_CLK_FSYS1_PHY0_OSCCLK;
	uint32_t	DBG_NFO_CLK_FSYS1_PHY1_OSCCLK;
	uint8_t		res26[0x7f8];
	uint32_t	DBG_NFO_CLK_BLK_FSYS1_UID_FSYS1_CMU_FSYS1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_AUXCLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_SOC_REF_CLK;
	uint32_t	DBG_NFO_CLK_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_AUXCLK;
	uint8_t		res27[0x1c];
	uint32_t	DBG_NFO_CLK_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_REF_XTAL;
	uint8_t		res28[0x4];
	uint32_t	DBG_NFO_GATE_CLK_FSYS1_PHY0_OSCCLLK;
	uint32_t	DBG_NFO_GATE_CLK_FSYS1_PHY1_OSCCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_AXI2APB_FSYS1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_BUS_D0_FSYS1_IPCLKPORT_MAINCLK;
	uint8_t		res29[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_BUS_S0_FSYS1_IPCLKPORT_M250CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_BUS_S0_FSYS1_IPCLKPORT_MAINCLK;
	uint8_t		res30[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_CPE425_0_FSYS1_IPCLKPORT_ACLK;
	uint8_t		res31[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_NS_BRDG_FSYS1_IPCLKPORT_CLK__PSOC_FSYS1__CLK_FSYS1_D0;
	uint8_t		res32[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_NS_BRDG_FSYS1_IPCLKPORT_CLK__PSOC_FSYS1__CLK_FSYS1_S0;
	uint8_t		res33[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_DBI_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_APB_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_I_DRIVER_APB_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_MSTR_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK0_IPCLKPORT_SLV_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_DBI_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_I_DRIVER_APB_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_MSTR_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_LINK1_IPCLKPORT_SLV_ACLK;
	uint8_t		res34[0x14];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_APB_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_PCIE_PHY0_IPCLKPORT_I_REF_SOC_PLL;
	uint8_t		res35[0x8];
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_SYSREG_FSYS1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_FSYS1_UID_TBU0_FSYS1_IPCLKPORT_ACLK;
	uint8_t		res36[0xf44];
	uint32_t	DBG_NFO_DMYQCH_CON_PCIE_LINK0_QCH_DUMMY_LINK0;
	uint32_t	DBG_NFO_DMYQCH_CON_PCIE_LINK1_QCH_DUMMY_LINK1;
	uint8_t		res37[0x8];
	uint32_t	DBG_NFO_DMYQCH_CON_PCIE_PHY0_QCH_DUMMY_PHY0;
	uint8_t		res38[0x4];
	uint32_t	DBG_NFO_LPI_CON_BUS_D0_FSYS1_QCH_BUSD0;
	uint8_t		res39[0x4];
	uint32_t	DBG_NFO_LPI_CON_BUS_S0_FSYS1_LPI_M250CLK;
	uint32_t	DBG_NFO_LPI_CON_BUS_S0_FSYS1_LPI_MAINCLK;
	uint8_t		res40[0x34];
	uint32_t	DBG_NFO_QCH_CON_CPE425_0_FSYS1_QCH_CPE0;
	uint8_t		res41[0x4];
	uint32_t	DBG_NFO_QCH_CON_FSYS1_CMU_FSYS1_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_FSYS1_PSOC_FSYS1_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_FSYS1_QCH_FSYS1_SYSREG;
	uint32_t	DBG_NFO_QCH_CON_TBU0_FSYS1_QCH_S_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU0_FSYS1_QCH_S_PG;
	uint32_t	DBG_NFO_QCH_CON_TBU0_FSYS1_QCH_S_PG_0;
	uint32_t	DBG_NFO_QCH_CON_TBU0_FSYS1_QCH_S_PG_1;
};

struct cmu_gpu {
	uint32_t	PLL_LOCKTIME_PLL_GPU;
	uint32_t	GPU_SHORTSTOP;
	uint32_t	GPU_DROOPDETECTOR;
	uint8_t		res0[0x114];
	uint32_t	PLL_CON0_GPU_CLK_SWITCH_MUX;
	uint32_t	PLL_CON1_GPU_CLK_SWITCH_MUX;
	uint32_t	PLL_CON2_GPU_CLK_SWITCH_MUX;
	uint8_t		res1[0x14];
	uint32_t	PLL_CON0_PLL_GPU;
	uint32_t	PLL_CON1_PLL_GPU;
	uint32_t	PLL_CON2_PLL_GPU;
	uint8_t		res2[0x4];
	uint32_t	PLL_CON4_PLL_GPU;
	uint8_t		res3[0x6ac];
	uint32_t	GPU_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_GPU_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_GPU_CMU_CLKOUT1;
	uint8_t		res5[0x7e8];
	uint32_t	CLK_CON_MUX_CLK_GPU_BUSD;
	uint8_t		res6[0x7fc];
	uint32_t	CLK_CON_DIV_CLK_DROOP_DETECTOR_GPU;
	uint32_t	CLK_CON_DIV_CLK_GPU_BUSACLK;
	uint32_t	CLK_CON_DIV_CLK_GPU_BUSP;
	uint32_t	CLK_CON_DIV_CLK_GPU_DD_BUSP0;
	uint32_t	CLK_CON_DIV_CLK_GPU_DD_BUSP1;
	uint32_t	CLK_CON_DIV_CLK_GPU_HPM;
	uint32_t	CLK_CON_DIV_DIV_CLK_GPU;
	uint8_t		res7[0x7e4];
	uint32_t	CLK_CON_BUF_BOUT_OSCCLK_GPU;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_BUSIF_HPMGPU_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_DD_GPU0_IPCLKPORT_CK_IN;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_DD_GPU1_IPCLKPORT_CK_IN;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_DD_GPU2_IPCLKPORT_CK_IN;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_DD_GPU3_IPCLKPORT_CK_IN;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_GPU_CMU_GPU_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_GPU_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_GPU_UID_HPM0_GPU_IPCLKPORT_HPM_TARGETCLK_C;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_AD_AXI_GPU_IPCLKPORT_ACLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_AD_AXI_GPU_IPCLKPORT_ACLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU0_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU0_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU1_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU1_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU2_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU2_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU3_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU3_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_AXI2APB_GPU_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_BUSIF_HPMGPU_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_BUS_P_GPU_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_BUS_P_GPU_IPCLKPORT_PERICLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_DD_GPU0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_DD_GPU1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_DD_GPU2_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_DD_GPU3_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_NS_BRDG_GPU_IPCLKPORT_CLK__PGPU__CLK_GPU_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_NS_BRDG_GPU_IPCLKPORT_CLK__PGPU__CLK_GPU_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_GPU_UID_SYSREG_GPU_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GPU_SHORTSTOP_CLK;
	uint8_t		res8[0xf84];
	uint32_t	DMYQCH_CON_DD_GPU0_QCH_DUMMY_DD0;
	uint32_t	DMYQCH_CON_DD_GPU1_QCH_DUMMY_DD1;
	uint32_t	DMYQCH_CON_DD_GPU2_QCH_DUMMY_DD2;
	uint32_t	DMYQCH_CON_DD_GPU3_QCH_DUMMY_DD3;
	uint32_t	DMYQCH_CON_GPU_QCH_DUMMY_GPU;
	uint32_t	LPI_CON_AD_AXI_GPU_LPI_M;
	uint32_t	LPI_CON_AD_AXI_GPU_LPI_S;
	uint32_t	LPI_CON_BUS_P_GPU_LPI_BUS_P_GPU_MAIN;
	uint32_t	LPI_CON_BUS_P_GPU_LPI_BUS_P_GPU_PERI;
	uint32_t	QCH_CON_BUSIF_HPMGPU_QCH_S_HPM_APBIF;
	uint32_t	QCH_CON_GPU_CMU_GPU_QCH;
	uint32_t	QCH_CON_NS_BRDG_GPU_PGPU_QCH;
	uint32_t	QCH_CON_SYSREG_GPU_QCH_CHANNEL00_S;
	uint8_t		res9[0xbcc];
	uint32_t	QUEUE_CTRL_REG_BLK_GPU_CMU_GPU;
	uint8_t		res10[0x41c];
	uint32_t	DBG_NFO_GPU_CLK_SWITCH_MUX;
	uint8_t		res11[0x1c];
	uint32_t	DBG_NFO_PLL_GPU;
	uint8_t		res12[0x7cc];
	uint32_t	DBG_NFO_BLK_GPU_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_GPU_CMU_CLKOUT1;
	uint8_t		res13[0x7e8];
	uint32_t	DBG_NFO_CLK_GPU_BUSD;
	uint8_t		res14[0x7fc];
	uint32_t	DBG_NFO_CLK_DROOP_DETECTOR_GPU;
	uint32_t	DBG_NFO_CLK_GPU_BUSACLK;
	uint32_t	DBG_NFO_CLK_GPU_BUSP;
	uint32_t	DBG_NFO_CLK_GPU_DD_BUSP0;
	uint32_t	DBG_NFO_CLK_GPU_DD_BUSP1;
	uint32_t	DBG_NFO_CLK_GPU_HPM;
	uint32_t	DBG_NFO_DIV_CLK_GPU;
	uint8_t		res15[0x7e4];
	uint32_t	DBG_NFO_BOUT_OSCCLK_GPU;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_BUSIF_HPMGPU_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_DD_GPU0_IPCLKPORT_CK_IN;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_DD_GPU1_IPCLKPORT_CK_IN;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_DD_GPU2_IPCLKPORT_CK_IN;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_DD_GPU3_IPCLKPORT_CK_IN;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_GPU_CMU_GPU_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_GPU_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_CLK_BLK_GPU_UID_HPM0_GPU_IPCLKPORT_HPM_TARGETCLK_C;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_AD_AXI_GPU_IPCLKPORT_ACLKM;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_AD_AXI_GPU_IPCLKPORT_ACLKS;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU0_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU0_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU1_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU1_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU2_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU2_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU3_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_APB_ASYNC_TOP_GPU3_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_AXI2APB_GPU_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_BUSIF_HPMGPU_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_BUS_P_GPU_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_BUS_P_GPU_IPCLKPORT_PERICLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_DD_GPU0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_DD_GPU1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_DD_GPU2_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_DD_GPU3_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_NS_BRDG_GPU_IPCLKPORT_CLK__PGPU__CLK_GPU_D;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_NS_BRDG_GPU_IPCLKPORT_CLK__PGPU__CLK_GPU_P;
	uint32_t	DBG_NFO_GOUT_BLK_GPU_UID_SYSREG_GPU_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GPU_SHORTSTOP_CLK;
	uint8_t		res16[0xf84];
	uint32_t	DBG_NFO_DMYQCH_CON_DD_GPU0_QCH_DUMMY_DD0;
	uint32_t	DBG_NFO_DMYQCH_CON_DD_GPU1_QCH_DUMMY_DD1;
	uint32_t	DBG_NFO_DMYQCH_CON_DD_GPU2_QCH_DUMMY_DD2;
	uint32_t	DBG_NFO_DMYQCH_CON_DD_GPU3_QCH_DUMMY_DD3;
	uint32_t	DBG_NFO_DMYQCH_CON_GPU_QCH_DUMMY_GPU;
	uint32_t	DBG_NFO_LPI_CON_AD_AXI_GPU_LPI_M;
	uint32_t	DBG_NFO_LPI_CON_AD_AXI_GPU_LPI_S;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_GPU_LPI_BUS_P_GPU_MAIN;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_GPU_LPI_BUS_P_GPU_PERI;
	uint32_t	DBG_NFO_QCH_CON_BUSIF_HPMGPU_QCH_S_HPM_APBIF;
	uint32_t	DBG_NFO_QCH_CON_GPU_CMU_GPU_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_GPU_PGPU_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_GPU_QCH_CHANNEL00_S;
	uint32_t	QCH_CON_HPM0_GPU_QCH;
};

struct cmu_imem {
	uint8_t		res0[0x100];
	uint32_t	PLL_CON0_CLK_IMEM_ACLK;
	uint32_t	PLL_CON1_CLK_IMEM_ACLK;
	uint32_t	PLL_CON2_CLK_IMEM_ACLK;
	uint8_t		res1[0x14];
	uint32_t	PLL_CON0_CLK_IMEM_INTMEMCLK;
	uint32_t	PLL_CON1_CLK_IMEM_INTMEMCLK;
	uint32_t	PLL_CON2_CLK_IMEM_INTMEMCLK;
	uint8_t		res2[0x14];
	uint32_t	PLL_CON0_CLK_IMEM_TCUCLK;
	uint32_t	PLL_CON1_CLK_IMEM_TCUCLK;
	uint32_t	PLL_CON2_CLK_IMEM_TCUCLK;
	uint8_t		res3[0x6b4];
	uint32_t	IMEM_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_IMEM_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_IMEM_CMU_CLKOUT1;
	uint8_t		res5[0xfe8];
	uint32_t	CLK_CON_DIV_DIV_OSCCLK_IMEM_TMUTSCLK;
	uint8_t		res6[0x7fc];
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_IMEM_CMU_IMEM_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_MCT_IPCLKPORT_OSCCLK__ALO;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_OTP_CON_TOP_IPCLKPORT_I_OSCCLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_RSTNSYNC_OSCCLK_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_CPU0_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_CPU0_IPCLKPORT_I_CLK_TS;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_CPU2_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_CPU2_IPCLKPORT_I_CLK_TS;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_GPU_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_GPU_IPCLKPORT_I_CLK_TS;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_GT_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_GT_IPCLKPORT_I_CLK_TS;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_TOP_IPCLKPORT_I_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_TMU_TOP_IPCLKPORT_I_CLK_TS;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_WDT0_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_WDT1_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_CLK_BLK_IMEM_UID_WDT2_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I0_IMEM_IPCLKPORT_ACLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I1_IMEM_IPCLKPORT_ACLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I2_IMEM_IPCLKPORT_ACLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I0_IMEM_IPCLKPORT_ACLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I1_IMEM_IPCLKPORT_ACLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I2_IMEM_IPCLKPORT_ACLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ASYNC_DMA0_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ASYNC_DMA0_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ASYNC_DMA1_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_ASYNC_DMA1_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_AXI2APB_IMEMP0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_AXI2APB_IMEMP1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_BUS_D_IMEM_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_PERICLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_TCUCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_DMA0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_DMA1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_GIC500_INPUT_SYNC_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_GIC_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_INTMEM_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_MAILBOX_SCS_CA72_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_MAILBOX_SMS_CA72_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_MCT_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSCO_IMEM__CLK_IMEM_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSCO_IMEM__CLK_IMEM_TCU;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSOC_IMEM__CLK_IMEM_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_OTP_CON_TOP_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_RSTNSYNC_ACLK_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_RSTNSYNC_INTMEMCLK_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_RSTNSYNC_TCUCLK_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_SFRIF_TMU0_IMEM_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_SFRIF_TMU1_IMEM_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_SYSREG_IMEM_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_TBU_IMEM_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_TCU_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_WDT0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_WDT1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_IMEM_UID_WDT2_IPCLKPORT_PCLK;
	uint8_t		res7[0xf20];
	uint32_t	DMYQCH_CON_GIC_QCH_DUMMY_GIC;
	uint32_t	DMYQCH_CON_INTMEM_QCH_DUMMY_INTMEM;
	uint32_t	DMYQCH_CON_TMU_CPU0_QCH_DUMMY_TMU_CPU0;
	uint32_t	DMYQCH_CON_TMU_CPU2_QCH_DUMMY_TMU_CPU2;
	uint32_t	DMYQCH_CON_TMU_GPU_QCH_DUMMY_TMU_GPU;
	uint32_t	DMYQCH_CON_TMU_GT_QCH_DUMMY_TMU_GT;
	uint32_t	DMYQCH_CON_TMU_TOP_QCH_DUMMY_TMU_TOP;
	uint32_t	LPI_CON_BUS_D_IMEM_CD_MAINCLK;
	uint32_t	LPI_CON_BUS_P_IMEM_CD_MAIN;
	uint32_t	LPI_CON_BUS_P_IMEM_CD_PERI;
	uint32_t	LPI_CON_BUS_P_IMEM_CD_TCU;
	uint32_t	QCH_CON_ADM_AXI4ST_I0_IMEM_Q_CLK_MST;
	uint32_t	QCH_CON_ADM_AXI4ST_I1_IMEM_Q_CLK_MST;
	uint32_t	QCH_CON_ADM_AXI4ST_I2_IMEM_Q_CLK_MST;
	uint32_t	QCH_CON_ADS_AXI4ST_I0_IMEM_Q_CLK_SLV;
	uint32_t	QCH_CON_ADS_AXI4ST_I0_IMEM_Q_PWR_SLV;
	uint32_t	QCH_CON_ADS_AXI4ST_I1_IMEM_Q_CLK_SLV;
	uint32_t	QCH_CON_ADS_AXI4ST_I1_IMEM_Q_PWR_SLV;
	uint32_t	QCH_CON_ADS_AXI4ST_I2_IMEM_Q_CLK_SLV;
	uint32_t	QCH_CON_ADS_AXI4ST_I2_IMEM_Q_PWR_SLV;
	uint32_t	QCH_CON_DMA0_QCH00_S;
	uint32_t	QCH_CON_DMA1_QCH00_S;
	uint32_t	QCH_CON_IMEM_CMU_IMEM_QCH;
	uint32_t	QCH_CON_MAILBOX_SCS_CA72_QCH_S0;
	uint32_t	QCH_CON_MAILBOX_SMS_CA72_QCH_S0;
	uint32_t	QCH_CON_MCT_QCH00_S;
	uint32_t	QCH_CON_NS_BRDG_IMEM_PSOC_IMEM_QCH;
	uint32_t	QCH_CON_OTP_CON_TOP_QCH_IMEMOTP;
	uint32_t	QCH_CON_SYSREG_IMEM_SYSREG_QCH00_S;
	uint32_t	QCH_CON_TBU_IMEM_QCH_S_CG;
	uint32_t	QCH_CON_TBU_IMEM_QCH_S_PD;
	uint32_t	QCH_CON_TCU_QCH00_S;
	uint32_t	QCH_CON_WDT0_QCH_S;
	uint32_t	QCH_CON_WDT1_QCH_S;
	uint32_t	QCH_CON_WDT2_QCH_S;
	uint8_t		res8[0xb74];
	uint32_t	QUEUE_CTRL_REG_BLK_IMEM_CMU_IMEM;
	uint8_t		res9[0x3fc];
	uint32_t	DBG_NFO_CLK_IMEM_ACLK;
	uint8_t		res10[0x1c];
	uint32_t	DBG_NFO_CLK_IMEM_INTMEMCLK;
	uint8_t		res11[0x1c];
	uint32_t	DBG_NFO_CLK_IMEM_TCUCLK;
	uint8_t		res12[0x7cc];
	uint32_t	DBG_NFO_BLK_IMEM_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_IMEM_CMU_CLKOUT1;
	uint8_t		res13[0xfe8];
	uint32_t	DBG_NFO_DIV_OSCCLK_IMEM_TMUTSCLK;
	uint8_t		res14[0x7fc];
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_IMEM_CMU_IMEM_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_MCT_IPCLKPORT_OSCCLK__ALO;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_OTP_CON_TOP_IPCLKPORT_I_OSCCLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_RSTNSYNC_OSCCLK_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_CPU0_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_CPU0_IPCLKPORT_I_CLK_TS;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_CPU2_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_CPU2_IPCLKPORT_I_CLK_TS;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_GPU_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_GPU_IPCLKPORT_I_CLK_TS;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_GT_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_GT_IPCLKPORT_I_CLK_TS;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_TOP_IPCLKPORT_I_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_TMU_TOP_IPCLKPORT_I_CLK_TS;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_WDT0_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_WDT1_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_CLK_BLK_IMEM_UID_WDT2_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I0_IMEM_IPCLKPORT_ACLKM;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I1_IMEM_IPCLKPORT_ACLKM;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADM_AXI4ST_I2_IMEM_IPCLKPORT_ACLKM;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I0_IMEM_IPCLKPORT_ACLKS;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I1_IMEM_IPCLKPORT_ACLKS;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ADS_AXI4ST_I2_IMEM_IPCLKPORT_ACLKS;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ASYNC_DMA0_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ASYNC_DMA0_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ASYNC_DMA1_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_ASYNC_DMA1_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_AXI2APB_IMEMP0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_AXI2APB_IMEMP1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_BUS_D_IMEM_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_PERICLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_BUS_P_IMEM_IPCLKPORT_TCUCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_DMA0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_DMA1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_GIC500_INPUT_SYNC_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_GIC_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_INTMEM_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_MAILBOX_SCS_CA72_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_MAILBOX_SMS_CA72_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_MCT_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSCO_IMEM__CLK_IMEM_D;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSCO_IMEM__CLK_IMEM_TCU;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_NS_BRDG_IMEM_IPCLKPORT_CLK__PSOC_IMEM__CLK_IMEM_P;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_OTP_CON_TOP_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_RSTNSYNC_ACLK_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_RSTNSYNC_INTMEMCLK_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_RSTNSYNC_TCUCLK_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_SFRIF_TMU0_IMEM_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_SFRIF_TMU1_IMEM_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_SYSREG_IMEM_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_TBU_IMEM_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_TCU_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_WDT0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_WDT1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_IMEM_UID_WDT2_IPCLKPORT_PCLK;
	uint8_t		res15[0xf20];
	uint32_t	DBG_NFO_DMYQCH_CON_GIC_QCH_DUMMY_GIC;
	uint32_t	DBG_NFO_DMYQCH_CON_INTMEM_QCH_DUMMY_INTMEM;
	uint32_t	DBG_NFO_DMYQCH_CON_TMU_CPU0_QCH_DUMMY_TMU_CPU0;
	uint32_t	DBG_NFO_DMYQCH_CON_TMU_CPU2_QCH_DUMMY_TMU_CPU2;
	uint32_t	DBG_NFO_DMYQCH_CON_TMU_GPU_QCH_DUMMY_TMU_GPU;
	uint32_t	DBG_NFO_DMYQCH_CON_TMU_GT_QCH_DUMMY_TMU_GT;
	uint32_t	DBG_NFO_DMYQCH_CON_TMU_TOP_QCH_DUMMY_TMU_TOP;
	uint32_t	DBG_NFO_LPI_CON_BUS_D_IMEM_CD_MAINCLK;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_IMEM_CD_MAIN;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_IMEM_CD_PERI;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_IMEM_CD_TCU;
	uint32_t	DBG_NFO_QCH_CON_ADM_AXI4ST_I0_IMEM_Q_CLK_MST;
	uint32_t	DBG_NFO_QCH_CON_ADM_AXI4ST_I1_IMEM_Q_CLK_MST;
	uint32_t	DBG_NFO_QCH_CON_ADM_AXI4ST_I2_IMEM_Q_CLK_MST;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I0_IMEM_Q_CLK_SLV;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I0_IMEM_Q_PWR_SLV;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I1_IMEM_Q_CLK_SLV;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I1_IMEM_Q_PWR_SLV;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I2_IMEM_Q_CLK_SLV;
	uint32_t	DBG_NFO_QCH_CON_ADS_AXI4ST_I2_IMEM_Q_PWR_SLV;
	uint32_t	DBG_NFO_QCH_CON_DMA0_QCH00_S;
	uint32_t	DBG_NFO_QCH_CON_DMA1_QCH00_S;
	uint32_t	DBG_NFO_QCH_CON_IMEM_CMU_IMEM_QCH;
	uint32_t	DBG_NFO_QCH_CON_MAILBOX_SCS_CA72_QCH_S0;
	uint32_t	DBG_NFO_QCH_CON_MAILBOX_SMS_CA72_QCH_S0;
	uint32_t	DBG_NFO_QCH_CON_MCT_QCH00_S;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_IMEM_PSOC_IMEM_QCH;
	uint32_t	DBG_NFO_QCH_CON_OTP_CON_TOP_QCH_IMEMOTP;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_IMEM_SYSREG_QCH00_S;
	uint32_t	DBG_NFO_QCH_CON_TBU_IMEM_QCH_S_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU_IMEM_QCH_S_PD;
	uint32_t	DBG_NFO_QCH_CON_TCU_QCH00_S;
	uint32_t	DBG_NFO_QCH_CON_WDT0_QCH_S;
	uint32_t	DBG_NFO_QCH_CON_WDT1_QCH_S;
	uint32_t	DBG_NFO_QCH_CON_WDT2_QCH_S;
};

struct cmu_isp {
	uint32_t	PLL_LOCKTIME_PLL_ISP;
	uint8_t		res0[0xfc];
	uint32_t	PLL_CON0_ISP_TCUCLK_MUX;
	uint32_t	PLL_CON1_ISP_TCUCLK_MUX;
	uint32_t	PLL_CON2_ISP_TCUCLK_MUX;
	uint8_t		res1[0x14];
	uint32_t	PLL_CON0_PLL_ISP;
	uint32_t	PLL_CON1_PLL_ISP;
	uint32_t	PLL_CON2_PLL_ISP;
	uint8_t		res2[0x4];
	uint32_t	PLL_CON4_PLL_ISP;
	uint8_t		res3[0x6cc];
	uint32_t	ISP_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_ISP_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_ISP_CMU_CLKOUT1;
	uint8_t		res5[0xfe8];
	uint32_t	CLK_CON_DIV_DIV_ISP_ACLK;
	uint32_t	CLK_CON_DIV_DIV_ISP_PCLK;
	uint8_t		res6[0x7f8];
	uint32_t	CLK_CON_GAT_CLK_BLK_ISP_UID_ISP_CMU_ISP_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_AXI2APB_ISP_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_BUS_P_ISP_IPCLKPORT_MAINCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_BUS_P_ISP_IPCLKPORT_TCUCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_VCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_P;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_TCU;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_SYSREG_ISP_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_TBU0_ISP_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_TBU1_ISP_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_ISP_UID_TCU_ISP_IPCLKPORT_ACLK;
	uint8_t		res7[0xfc8];
	uint32_t	DMYQCH_CON_ISP_QCH_DUMMY_ISP_ACLK;
	uint32_t	DMYQCH_CON_ISP_QCH_DUMMY_ISP_PCLK;
	uint32_t	DMYQCH_CON_ISP_QCH_DUMMY_ISP_VCLK;
	uint32_t	LPI_CON_BUS_P_ISP_LPI_MAINCLK;
	uint32_t	LPI_CON_BUS_P_ISP_LPI_TCUCLK;
	uint32_t	QCH_CON_ISP_CMU_ISP_QCH;
	uint32_t	QCH_CON_NS_BRDG_ISP_NOC1_ISP_QCH;
	uint32_t	QCH_CON_SYSREG_ISP_QCH_ISP_SYSREG;
	uint32_t	QCH_CON_TBU0_ISP_TBU0_ISP_CG_QCH;
	uint32_t	QCH_CON_TBU0_ISP_TBU0_ISP_MST_BR_QCH;
	uint32_t	QCH_CON_TBU0_ISP_TBU0_ISP_PD_QCH;
	uint32_t	QCH_CON_TBU0_ISP_TBU0_ISP_SLV_BR_QCH;
	uint32_t	QCH_CON_TBU1_ISP_TBU1_ISP_CG_QCH;
	uint32_t	QCH_CON_TBU1_ISP_TBU1_ISP_MST_BR_QCH;
	uint32_t	QCH_CON_TBU1_ISP_TBU1_ISP_PD_QCH;
	uint32_t	QCH_CON_TBU1_ISP_TBU1_ISP_SLV_BR_QCH;
	uint32_t	QCH_CON_TCU_ISP_QCH_TCU;
	uint8_t		res8[0xbbc];
	uint32_t	QUEUE_CTRL_REG_BLK_ISP_CMU_ISP;
	uint8_t		res9[0x3fc];
	uint32_t	DBG_NFO_ISP_TCUCLK_MUX;
	uint8_t		res10[0x1c];
	uint32_t	DBG_NFO_PLL_ISP;
	uint8_t		res11[0x7ec];
	uint32_t	DBG_NFO_BLK_ISP_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_ISP_CMU_CLKOUT1;
	uint8_t		res12[0xfe8];
	uint32_t	DBG_NFO_DIV_ISP_ACLK;
	uint32_t	DBG_NFO_DIV_ISP_PCLK;
	uint8_t		res13[0x7f8];
	uint32_t	DBG_NFO_CLK_BLK_ISP_UID_ISP_CMU_ISP_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_AXI2APB_ISP_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_BUS_P_ISP_IPCLKPORT_MAINCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_BUS_P_ISP_IPCLKPORT_TCUCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_ISP_IPCLKPORT_VCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_D;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_P;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_NS_BRDG_ISP_IPCLKPORT_CLK__PSOC_ISP__CLK_ISP_TCU;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_SYSREG_ISP_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_TBU0_ISP_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_TBU1_ISP_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_ISP_UID_TCU_ISP_IPCLKPORT_ACLK;
	uint8_t		res14[0xfc8];
	uint32_t	DBG_NFO_DMYQCH_CON_ISP_QCH_DUMMY_ISP_ACLK;
	uint32_t	DBG_NFO_DMYQCH_CON_ISP_QCH_DUMMY_ISP_PCLK;
	uint32_t	DBG_NFO_DMYQCH_CON_ISP_QCH_DUMMY_ISP_VCLK;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_ISP_LPI_MAINCLK;
	uint32_t	DBG_NFO_LPI_CON_BUS_P_ISP_LPI_TCUCLK;
	uint32_t	DBG_NFO_QCH_CON_ISP_CMU_ISP_QCH;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_ISP_NOC1_ISP_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_ISP_QCH_ISP_SYSREG;
	uint32_t	DBG_NFO_QCH_CON_TBU0_ISP_TBU0_ISP_CG_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU0_ISP_TBU0_ISP_MST_BR_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU0_ISP_TBU0_ISP_PD_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU0_ISP_TBU0_ISP_SLV_BR_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU1_ISP_TBU1_ISP_CG_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU1_ISP_TBU1_ISP_MST_BR_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU1_ISP_TBU1_ISP_PD_QCH;
	uint32_t	DBG_NFO_QCH_CON_TBU1_ISP_TBU1_ISP_SLV_BR_QCH;
	uint32_t	DBG_NFO_QCH_CON_TCU_ISP_QCH_TCU;
};

struct cmu_mfc {
	uint32_t	PLL_LOCKTIME_PLL_MFC;
	uint8_t		res0[0xfc];
	uint32_t	PLL_CON0_PLL_MFC;
	uint32_t	PLL_CON1_PLL_MFC;
	uint32_t	PLL_CON2_PLL_MFC;
	uint8_t		res1[0x4];
	uint32_t	PLL_CON4_PLL_MFC;
	uint8_t		res2[0x6ec];
	uint32_t	MFC_CMU_CONTROLLER_OPTION;
	uint8_t		res3[0xc];
	uint32_t	CLKOUT_CON_BLK_MFC_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_MFC_CMU_CLKOUT1;
	uint8_t		res4[0x7e8];
	uint32_t	CLK_CON_MUX_MFC_BUSD;
	uint8_t		res5[0x4];
	uint32_t	CLK_CON_MUX_MFC_BUSP;
	uint8_t		res6[0x7f4];
	uint32_t	CLK_CON_DIV_MFC_BUSD_DIV4;
	uint8_t		res7[0x7fc];
	uint32_t	CLK_CON_GAT_CLK_BLK_MFC_UID_MFC_CMU_MFC_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_AS_P_MFC_IPCLKPORT_PCLKM;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_AS_P_MFC_IPCLKPORT_PCLKS;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_AXI2APB_MFC_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_MFC_IPCLKPORT_ACLK;
	uint8_t		res8[0x4];
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_NS_BRDG_MFC_IPCLKPORT_CLK__PMFC__CLK_MFC_D;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_NS_BRDG_MFC_IPCLKPORT_CLK__PMFC__CLK_MFC_P;
	uint8_t		res9[0x8];
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_PPMU_MFCD0_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_PPMU_MFCD0_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_PPMU_MFCD1_IPCLKPORT_ACLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_PPMU_MFCD1_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_SYSREG_MFC_IPCLKPORT_PCLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_TBU_MFCD0_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_GOUT_BLK_MFC_UID_TBU_MFCD1_IPCLKPORT_CLK;
	uint32_t	CLK_CON_GAT_MFC_BUSD_DIV4_GATE;
	uint32_t	CLK_CON_GAT_MFC_BUSD_GATE;
	uint8_t		res10[0xfb4];
	uint32_t	DMYQCH_CON_AS_P_MFC_QCH_DUMMY_AS;
	uint32_t	QCH_CON_MFC_CMU_MFC_QCH;
	uint32_t	QCH_CON_MFC_QCH_MFC;
	uint32_t	QCH_CON_NS_BRDG_MFC_PMFC_QCH;
	uint32_t	QCH_CON_PPMU_MFCD0_QCH;
	uint32_t	QCH_CON_PPMU_MFCD1_QCH;
	uint32_t	QCH_CON_SYSREG_MFC_QCH_SYSREG;
	uint32_t	QCH_CON_TBU_MFCD0_QCH_S_CG;
	uint32_t	QCH_CON_TBU_MFCD0_QCH_S_PG;
	uint32_t	QCH_CON_TBU_MFCD0_QCH_S_PG_0;
	uint32_t	QCH_CON_TBU_MFCD0_QCH_S_PG_1;
	uint32_t	QCH_CON_TBU_MFCD1_QCH_S_CG;
	uint32_t	QCH_CON_TBU_MFCD1_QCH_S_PG;
	uint32_t	QCH_CON_TBU_MFCD1_QCH_S_PG_0;
	uint32_t	QCH_CON_TBU_MFCD1_QCH_S_PG_1;
	uint8_t		res11[0xbc4];
	uint32_t	QUEUE_CTRL_REG_BLK_MFC_CMU_MFC;
	uint8_t		res12[0x3fc];
	uint32_t	DBG_NFO_PLL_MFC;
	uint8_t		res13[0x80c];
	uint32_t	DBG_NFO_BLK_MFC_CMU_CLKOUT0;
	uint32_t	DBG_NFO_BLK_MFC_CMU_CLKOUT1;
	uint8_t		res14[0x7e8];
	uint32_t	DBG_NFO_MFC_BUSD;
	uint8_t		res15[0x4];
	uint32_t	DBG_NFO_MFC_BUSP;
	uint8_t		res16[0x7f4];
	uint32_t	DBG_NFO_MFC_BUSD_DIV4;
	uint8_t		res17[0x7fc];
	uint32_t	DBG_NFO_CLK_BLK_MFC_UID_MFC_CMU_MFC_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_AS_P_MFC_IPCLKPORT_PCLKM;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_AS_P_MFC_IPCLKPORT_PCLKS;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_AXI2APB_MFC_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_MFC_IPCLKPORT_ACLK;
	uint8_t		res18[0x4];
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_NS_BRDG_MFC_IPCLKPORT_CLK__PMFC__CLK_MFC_D;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_NS_BRDG_MFC_IPCLKPORT_CLK__PMFC__CLK_MFC_P;
	uint8_t		res19[0x8];
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_PPMU_MFCD0_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_PPMU_MFCD0_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_PPMU_MFCD1_IPCLKPORT_ACLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_PPMU_MFCD1_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_SYSREG_MFC_IPCLKPORT_PCLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_TBU_MFCD0_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_GOUT_BLK_MFC_UID_TBU_MFCD1_IPCLKPORT_CLK;
	uint32_t	DBG_NFO_MFC_BUSD_DIV4_GATE;
	uint32_t	DBG_NFO_MFC_BUSD_GATE;
	uint8_t		res20[0xfb4];
	uint32_t	DBG_NFO_DMYQCH_CON_AS_P_MFC_QCH_DUMMY_AS;
	uint32_t	DBG_NFO_QCH_CON_MFC_CMU_MFC_QCH;
	uint32_t	DBG_NFO_QCH_CON_MFC_QCH_MFC;
	uint32_t	DBG_NFO_QCH_CON_NS_BRDG_MFC_PMFC_QCH;
	uint32_t	DBG_NFO_QCH_CON_PPMU_MFCD0_QCH;
	uint32_t	DBG_NFO_QCH_CON_PPMU_MFCD1_QCH;
	uint32_t	DBG_NFO_QCH_CON_SYSREG_MFC_QCH_SYSREG;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD0_QCH_S_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD0_QCH_S_PG;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD0_QCH_S_PG_0;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD0_QCH_S_PG_1;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD1_QCH_S_CG;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD1_QCH_S_PG;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD1_QCH_S_PG_0;
	uint32_t	DBG_NFO_QCH_CON_TBU_MFCD1_QCH_S_PG_1;
};

struct cmu_mif {
	uint32_t reserved_0[64];
	uint32_t PLL_CON0_MIF_PLL_MUX	;/* 0x100 */
	uint32_t PLL_CON1_MIF_PLL_MUX	;/* 0x104 */
	uint32_t PLL_CON2_MIF_PLL_MUX	;/* 0x108 */
	uint32_t reserved_1[445];
	uint32_t MIF_CMU_CONTROLLER_OPTION	;/* 0x800 */
	uint32_t reserved_2[3];
	uint32_t CLKOUT_CON_BLK_MIF_CMU_CLKOUT0	;/* 0x810 */
	uint32_t CLKOUT_CON_BLK_MIF_CMU_CLKOUT1	;/* 0x814 */
	uint32_t reserved_3[1018];
	uint32_t CLK_CON_DIV_MIF_BYPASSDIV4_ACLK	;/* 0x1800 */
	uint32_t reserved_4[1];
	uint32_t CLK_CON_DIV_MIF_PLLDIV_PCLK	;/* 0x1808 */
	uint32_t reserved_5[509];
	uint32_t CLK_CON_GAT_CLK_BLK_MIF_UID_MIF_CMU_MIF_IPCLKPORT_PCLK	;/* 0x2000 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_AXI2APB_MIF_IPCLKPORT_ACLK	;/* 0x2004 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_DMC_MIF_IPCLKPORT_ACLK_0	;/* 0x2008 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_DMC_MIF_IPCLKPORT_CORE_DDRC_CORE_CLK	;/* 0x200c */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_DMC_MIF_IPCLKPORT_PCLK	;/* 0x2010 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_LPDDR4PHY_MIF_IPCLKPORT_APBCLK	;/* 0x2014 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_LPDDR4PHY_MIF_IPCLKPORT_BYPASSPCLK	;/* 0x2018 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_LPDDR4PHY_MIF_IPCLKPORT_DFICLK	;/* 0x201c */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_LPDDR4PHY_MIF_IPCLKPORT_DFICTLK	;/* 0x2020 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_NS_BRDG_MIF_IPCLKPORT_CLK__PMIF0__CLK_MIF0_D	;/* 0x2024 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_NS_BRDG_MIF_IPCLKPORT_CLK__PMIF0__CLK_MIF0_P	;/* 0x2028 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_PPC_DMC0_MIF_IPCLKPORT_CLK	;/* 0x202c */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_PPC_DMC0_MIF_IPCLKPORT_PCLK	;/* 0x2030 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_PPC_DMC1_MIF_IPCLKPORT_CLK	;/* 0x2034 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_PPC_DMC1_MIF_IPCLKPORT_PCLK	;/* 0x2038 */
	uint32_t CLK_CON_GAT_GOUT_BLK_MIF_UID_SYSREG_MIF_IPCLKPORT_PCLK	;/* 0x203c */
	uint32_t reserved_6[1008];
	uint32_t DMYQCH_CON_DMC_MIF_QCH_DUMMY_DMC	;/* 0x3000 */
	uint32_t reserved_7[1];
	uint32_t LPI_CON_DMC_MIF_LPI_DDRC_CORE_CLK	;/* 0x3008 */
	uint32_t QCH_CON_MIF_CMU_MIF_QCH	;/* 0x300c */
	uint32_t QCH_CON_NS_BRDG_MIF_PMIF_QCH	;/* 0x3010 */
	uint32_t QCH_CON_PPC_DMC0_MIF_Q_CHANNEL00_S	;/* 0x3014 */
	uint32_t QCH_CON_PPC_DMC1_MIF_Q_CHANNEL00_S	;/* 0x3018 */
	uint32_t QCH_CON_SYSREG_MIF_QCH_MIF_SYSREG	;/* 0x301c */
	uint32_t reserved_8[760];
	uint32_t QUEUE_CTRL_REG_BLK_MIF_CMU_MIF	;/* 0x3c00 */
	/* LAST ADDR = 0x3c00 */
};

struct cmu_peric {
	uint32_t reserved_0[64];
	uint32_t PLL_CON0_PERIC_DMACLK_MUX	;/* 0x100 */
	uint32_t PLL_CON1_PERIC_DMACLK_MUX	;/* 0x104 */
	uint32_t PLL_CON2_PERIC_DMACLK_MUX	;/* 0x108 */
	uint32_t reserved_1[5];
	uint32_t PLL_CON0_PERIC_EQOS_BUSCLK_MUX	;/* 0x120 */
	uint32_t PLL_CON1_PERIC_EQOS_BUSCLK_MUX	;/* 0x124 */
	uint32_t PLL_CON2_PERIC_EQOS_BUSCLK_MUX	;/* 0x128 */
	uint32_t reserved_2[5];
	uint32_t PLL_CON0_PERIC_PCLK_MUX	;/* 0x140 */
	uint32_t PLL_CON1_PERIC_PCLK_MUX	;/* 0x144 */
	uint32_t PLL_CON2_PERIC_PCLK_MUX	;/* 0x148 */
	uint32_t reserved_3[5];
	uint32_t PLL_CON0_PERIC_TBUCLK_MUX	;/* 0x160 */
	uint32_t PLL_CON1_PERIC_TBUCLK_MUX	;/* 0x164 */
	uint32_t PLL_CON2_PERIC_TBUCLK_MUX	;/* 0x168 */
	uint32_t reserved_4[5];
	uint32_t PLL_CON0_SPI_CLK	;/* 0x180 */
	uint32_t PLL_CON1_SPI_CLK	;/* 0x184 */
	uint32_t PLL_CON2_SPI_CLK	;/* 0x188 */
	uint32_t reserved_5[5];
	uint32_t PLL_CON0_SPI_PCLK	;/* 0x1a0 */
	uint32_t PLL_CON1_SPI_PCLK	;/* 0x1a4 */
	uint32_t PLL_CON2_SPI_PCLK	;/* 0x1a8 */
	uint32_t reserved_6[5];
	uint32_t PLL_CON0_UART_CLK	;/* 0x1c0 */
	uint32_t PLL_CON1_UART_CLK	;/* 0x1c4 */
	uint32_t PLL_CON2_UART_CLK	;/* 0x1c8 */
	uint32_t reserved_7[5];
	uint32_t PLL_CON0_UART_PCLK	;/* 0x1e0 */
	uint32_t PLL_CON1_UART_PCLK	;/* 0x1e4 */
	uint32_t PLL_CON2_UART_PCLK	;/* 0x1e8 */
	uint32_t reserved_8[389];
	uint32_t PERIC_CMU_CONTROLLER_OPTION	;/* 0x800 */
	uint32_t reserved_9[3];
	uint32_t CLKOUT_CON_BLK_PERIC_CMU_CLKOUT0	;/* 0x810 */
	uint32_t CLKOUT_CON_BLK_PERIC_CMU_CLKOUT1	;/* 0x814 */
	uint32_t reserved_10[506];
	uint32_t CLK_CON_MUX_MUX_PERIC_EQOS_PHYRXCLK	;/* 0x1000 */
	uint32_t reserved_11[511];
	uint32_t CLK_CON_DIV_DIV_EQOS_BUSCLK	;/* 0x1800 */
	uint32_t CLK_CON_DIV_DIV_PERIC_MCAN_CLK	;/* 0x1804 */
	uint32_t CLK_CON_DIV_DIV_RGMII_CLK	;/* 0x1808 */
	uint32_t CLK_CON_DIV_DIV_RII_CLK	;/* 0x180c */
	uint32_t CLK_CON_DIV_DIV_RMII_CLK	;/* 0x1810 */
	uint32_t CLK_CON_DIV_DIV_SPI_CLK	;/* 0x1814 */
	uint32_t CLK_CON_DIV_DIV_UART_CLK	;/* 0x1818 */
	uint32_t reserved_12[505];
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_CLK_PTP_REF_I	;/* 0x2000 */
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_GPIO_PERIC_IPCLKPORT_OSCCLK	;/* 0x2004 */
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_PERIC_ADC0_IPCLKPORT_I_OSCCLK	;/* 0x2008 */
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_PERIC_CMU_PERIC_IPCLKPORT_PCLK	;/* 0x200c */
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_PERIC_PWM0_IPCLKPORT_I_OSCCLK	;/* 0x2010 */
	uint32_t CLK_CON_GAT_CLK_BLK_PERIC_UID_PERIC_PWM1_IPCLKPORT_I_OSCCLK	;/* 0x2014 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_ASYNC_APB_DMA0_IPCLKPORT_PCLKM	;/* 0x2018 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_ASYNC_APB_DMA0_IPCLKPORT_PCLKS	;/* 0x201c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_ASYNC_APB_DMA1_IPCLKPORT_PCLKM	;/* 0x2020 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_ASYNC_APB_DMA1_IPCLKPORT_PCLKS	;/* 0x2024 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_AXI2APB_PERIC0_IPCLKPORT_ACLK	;/* 0x2028 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_AXI2APB_PERIC1_IPCLKPORT_ACLK	;/* 0x202c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_AXI2APB_PERIC2_IPCLKPORT_ACLK	;/* 0x2030 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_D_PERIC_IPCLKPORT_DMACLK	;/* 0x2034 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_D_PERIC_IPCLKPORT_EQOSCLK	;/* 0x2038 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_D_PERIC_IPCLKPORT_MAINCLK	;/* 0x203c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_P_PERIC_IPCLKPORT_EQOSCLK	;/* 0x2040 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_P_PERIC_IPCLKPORT_MAINCLK	;/* 0x2044 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_BUS_P_PERIC_IPCLKPORT_SMMUCLK	;/* 0x2048 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_ACLK_I	;/* 0x204c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_CLK_RX_I	;/* 0x2050 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_HCLK_I	;/* 0x2054 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_RGMII_CLK_I	;/* 0x2058 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_RII_CLK_I	;/* 0x205c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_EQOS_TOP_IPCLKPORT_RMII_CLK_I	;/* 0x2060 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_GPIO_PERIC_IPCLKPORT_PCLK	;/* 0x2064 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_NS_BRDG_PERIC_IPCLKPORT_CLK__PSOC_PERIC__CLK_PERIC_D	;/* 0x2068 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_NS_BRDG_PERIC_IPCLKPORT_CLK__PSOC_PERIC__CLK_PERIC_P	;/* 0x206c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_ADC0_IPCLKPORT_PCLK_S0	;/* 0x2070 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_DMA0_IPCLKPORT_ACLK	;/* 0x2074 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_DMA1_IPCLKPORT_ACLK	;/* 0x2078 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C0_IPCLKPORT_I_PCLK	;/* 0x207c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C1_IPCLKPORT_I_PCLK	;/* 0x2080 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C2_IPCLKPORT_I_PCLK	;/* 0x2084 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C3_IPCLKPORT_I_PCLK	;/* 0x2088 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C4_IPCLKPORT_I_PCLK	;/* 0x208c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C5_IPCLKPORT_I_PCLK	;/* 0x2090 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C6_IPCLKPORT_I_PCLK	;/* 0x2094 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_I2C7_IPCLKPORT_I_PCLK	;/* 0x2098 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN0_IPCLKPORT_CCLK	;/* 0x209c */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN0_IPCLKPORT_PCLK	;/* 0x20a0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN1_IPCLKPORT_CCLK	;/* 0x20a4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN1_IPCLKPORT_PCLK	;/* 0x20a8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN2_IPCLKPORT_CCLK	;/* 0x20ac */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN2_IPCLKPORT_PCLK	;/* 0x20b0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN3_IPCLKPORT_CCLK	;/* 0x20b4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_MCAN3_IPCLKPORT_PCLK	;/* 0x20b8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_PWM0_IPCLKPORT_I_PCLK_S0	;/* 0x20bc */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_PWM1_IPCLKPORT_I_PCLK_S0	;/* 0x20c0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SMMU_IPCLKPORT_CCLK	;/* 0x20c4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SMMU_IPCLKPORT_PERIC_BCLK	;/* 0x20c8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI0_IPCLKPORT_I_PCLK	;/* 0x20cc */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI0_IPCLKPORT_I_SCLK_SPI	;/* 0x20d0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI1_IPCLKPORT_I_PCLK	;/* 0x20d4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI1_IPCLKPORT_I_SCLK_SPI	;/* 0x20d8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI2_IPCLKPORT_I_PCLK	;/* 0x20dc */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_SPI2_IPCLKPORT_I_SCLK_SPI	;/* 0x20e0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_TDM0_IPCLKPORT_HCLK_M	;/* 0x20e4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_TDM0_IPCLKPORT_PCLK	;/* 0x20e8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_TDM1_IPCLKPORT_HCLK_M	;/* 0x20ec */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_TDM1_IPCLKPORT_PCLK	;/* 0x20f0 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_UART0_IPCLKPORT_I_SCLK_UART	;/* 0x20f4 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_UART0_IPCLKPORT_PCLK	;/* 0x20f8 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_UART1_IPCLKPORT_I_SCLK_UART	;/* 0x20fc */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_PERIC_UART1_IPCLKPORT_PCLK	;/* 0x2100 */
	uint32_t CLK_CON_GAT_GOUT_BLK_PERIC_UID_SYSREG_PERI_IPCLKPORT_PCLK	;/* 0x2104 */
	uint32_t reserved_13[958];
	uint32_t DMYQCH_CON_EQOS_TOP_QCH_DUMMY_EQOS	;/* 0x3000 */
	uint32_t DMYQCH_CON_PERIC_MCAN0_QCH_DUMMY_CAN0	;/* 0x3004 */
	uint32_t DMYQCH_CON_PERIC_MCAN1_QCH_DUMMY_CAN1	;/* 0x3008 */
	uint32_t DMYQCH_CON_PERIC_MCAN2_QCH_DUMMY_CAN2	;/* 0x300c */
	uint32_t DMYQCH_CON_PERIC_MCAN3_QCH_DUMMY_CAN3	;/* 0x3010 */
	uint32_t DMYQCH_CON_PERIC_TDM0_QCH_DUMMY_TDM0	;/* 0x3014 */
	uint32_t DMYQCH_CON_PERIC_TDM1_QCH_DUMMY_TDM1	;/* 0x3018 */
	uint32_t LPI_CON_BUS_D_PERIC_CD_DMA	;/* 0x301c */
	uint32_t LPI_CON_BUS_D_PERIC_CD_EQOS	;/* 0x3020 */
	uint32_t LPI_CON_BUS_D_PERIC_CD_MAIN	;/* 0x3024 */
	uint32_t LPI_CON_BUS_P_PERIC_CD_EQOS	;/* 0x3028 */
	uint32_t LPI_CON_BUS_P_PERIC_CD_MAIN	;/* 0x302c */
	uint32_t LPI_CON_BUS_P_PERIC_CD_SMMU	;/* 0x3030 */
	uint32_t LPI_CON_EQOS_TOP_LPI_EQOS	;/* 0x3034 */
	uint32_t QCH_CON_GPIO_PERIC_QCH_S	;/* 0x3038 */
	uint32_t QCH_CON_NS_BRDG_PERIC_PSOC_PERIC_QCH	;/* 0x303c */
	uint32_t QCH_CON_PERIC_ADC0_Q_CHANNEL_S0	;/* 0x3040 */
	uint32_t QCH_CON_PERIC_CMU_PERIC_QCH	;/* 0x3044 */
	uint32_t QCH_CON_PERIC_DMA0_QCH_DMA0	;/* 0x3048 */
	uint32_t QCH_CON_PERIC_DMA1_QCH_DMA1	;/* 0x304c */
	uint32_t QCH_CON_PERIC_I2C0_QCH_S	;/* 0x3050 */
	uint32_t QCH_CON_PERIC_I2C1_QCH_S	;/* 0x3054 */
	uint32_t QCH_CON_PERIC_I2C2_QCH_S	;/* 0x3058 */
	uint32_t QCH_CON_PERIC_I2C3_QCH_S	;/* 0x305c */
	uint32_t QCH_CON_PERIC_I2C4_QCH_S	;/* 0x3060 */
	uint32_t QCH_CON_PERIC_I2C5_QCH_S	;/* 0x3064 */
	uint32_t QCH_CON_PERIC_I2C6_QCH_S	;/* 0x3068 */
	uint32_t QCH_CON_PERIC_I2C7_QCH_S	;/* 0x306c */
	uint32_t QCH_CON_PERIC_PWM0_QCH_S	;/* 0x3070 */
	uint32_t QCH_CON_PERIC_PWM1_QCH_S	;/* 0x3074 */
	uint32_t QCH_CON_PERIC_SMMU_QCH_TBU_PERIC_CG	;/* 0x3078 */
	uint32_t QCH_CON_PERIC_SMMU_QCH_TBU_PERIC_PD	;/* 0x307c */
	uint32_t QCH_CON_PERIC_SMMU_QCH_TCU	;/* 0x3080 */
	uint32_t QCH_CON_PERIC_SPI0_QCH_S	;/* 0x3084 */
	uint32_t QCH_CON_PERIC_SPI1_QCH_S	;/* 0x3088 */
	uint32_t QCH_CON_PERIC_SPI2_QCH_S	;/* 0x308c */
	uint32_t QCH_CON_PERIC_UART0_QCH_S	;/* 0x3090 */
	uint32_t QCH_CON_PERIC_UART1_QCH_S	;/* 0x3094 */
	uint32_t QCH_CON_SYSREG_PERI_QCH_S	;/* 0x3098 */
	uint32_t reserved_14[729];
	uint32_t QUEUE_CTRL_REG_BLK_PERIC_CMU_PERIC	;/* 0x3c00 */
	/* LAST ADDR = 0x3c00 */
};

struct cmu_trip {
	uint32_t	PLL_LOCKTIME_PLL_TRIP;
	uint32_t	TRIP_SHORTSTOP;
	uint32_t	TRIP_DROOPDETECTOR;
	uint8_t		res0[0xf4];
	uint32_t	PLL_CON0_PLL_TRIP;
	uint32_t	PLL_CON1_PLL_TRIP;
	uint32_t	PLL_CON2_PLL_TRIP;
	uint8_t		res1[0x4];
	uint32_t	PLL_CON4_PLL_TRIP;
	uint8_t		res2[0xc];
	uint32_t	PLL_CON0_TRIP_SWITCH_MUX;
	uint32_t	PLL_CON1_TRIP_SWITCH_MUX;
	uint32_t	PLL_CON2_TRIP_SWITCH_MUX;
	uint8_t		res3[0x6d4];
	uint32_t	TRIP_CMU_CONTROLLER_OPTION;
	uint8_t		res4[0xc];
	uint32_t	CLKOUT_CON_BLK_TRIP_CMU_CLKOUT0;
	uint32_t	CLKOUT_CON_BLK_TRIP_CMU_CLKOUT1;
	uint8_t		res5[0x7e8];
	uint32_t	CLK_CON_MUX_ECLK_ACLK_MUX;
	uint32_t	CLK_CON_MUX_TRIP_SWITCH_PLL_MUX;
	uint8_t		res6[0x7f8];
	uint32_t	CLK_CON_DIV_CLK_DROOP_DETECTOR;
	uint32_t	CLK_CON_DIV_CLK_HPM_TARGET;
	uint32_t	CLK_CON_DIV_DIV_CLK_TRIP;
	uint32_t	CLK_CON_DIV_TRIP_ACLK;
	uint32_t	CLK_CON_DIV_TRIP_PCLK;
	uint32_t	CLK_CON_DIV_TRIP_PCLK_DD;
